Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK-MC_DFP/1.11.151/atdf/PIC32MK0128MCA032.atdf
         <register caption="ADC Control Register 3" name="ADCCON3" offset="0x20" rw="RW" size="4">
            <bitfield caption="Analog Input Select bits" mask="0x0000003F" name="ADINSEL" values="ADCCON3__ADINSEL" />
            <bitfield caption="Global Software Trigger bit" mask="0x00000040" name="GSWTRG" values="ADCCON3__GSWTRG" />
            <bitfield caption="Global Level Software Trigger bit" mask="0x00000080" name="GLSWTRG" values="ADCCON3__GLSWTRG" />
            <bitfield caption="Individual ADC Input Conversion Request bit" mask="0x00000100" name="RQCNVRT" values="ADCCON3__RQCNVRT" />
            <bitfield caption="Shared ADC7 Analog Input Sampling Enable bit " mask="0x00000200" name="SAMP" values="ADCCON3__SAMP" />
            <bitfield caption="ADC Update Ready Status bit" mask="0x00000400" name="UPDRDY" values="ADCCON3__UPDRDY" />
            <bitfield caption="Update Ready Interrupt Enable bit" mask="0x00000800" name="UPDIEN" values="ADCCON3__UPDIEN" />
            <bitfield caption="Trigger Suspend bit" mask="0x00001000" name="TRGSUSP" values="ADCCON3__TRGSUSP" />
            <bitfield caption="Voltage Reference Input Selection bits" mask="0x0000E000" name="VREFSEL" values="ADCCON3__VREFSEL" />
            <bitfield caption="ADC0 Digital Enable bit" mask="0x00010000" name="DIGEN0" values="ADCCON3__DIGEN0" />
            <bitfield caption="ADC1 Digital Enable bit" mask="0x00020000" name="DIGEN1" values="ADCCON3__DIGEN1" />
            <bitfield caption="ADC2 Digital Enable bit" mask="0x00800000" name="DIGEN7" values="ADCCON3__DIGEN7" />
            <bitfield caption="Analog-to-Digital Control Clock Divider bits" mask="0x3F000000" name="CONCLKDIV" values="ADCCON3__CONCLKDIV" />
            <bitfield caption="Analog-to-Digital Clock Source bits" mask="0xC0000000" name="ADCSEL" values="ADCCON3__ADCSEL" />
         </register>
         <register caption="ADC Triggering Mode for Dedicated ADC Register" name="ADCTRGMODE" offset="0x30" rw="RW" size="4">
            <bitfield caption="ADC0 Synchronous Sampling bit" mask="0x00000001" name="SSAMPEN0" values="ADCTRGMODE__SSAMPEN0" />
            <bitfield caption="ADC1 Synchronous Sampling bit" mask="0x00000002" name="SSAMPEN1" values="ADCTRGMODE__SSAMPEN1" />
            <bitfield caption="ADC0 Presynchronized Triggers bit" mask="0x00000100" name="STRGEN0" values="ADCTRGMODE__STRGEN0" />
            <bitfield caption="ADC1 Presynchronized Triggers bit" mask="0x00000200" name="STRGEN1" values="ADCTRGMODE__STRGEN1" />
            <bitfield caption="ADC0 Analog Input Select bit" mask="0x00030000" name="SH0ALT" values="ADCTRGMODE__SH0ALT" />
            <bitfield caption="ADC1 Analog Input Select bit" mask="0x000C0000" name="SH1ALT" values="ADCTRGMODE__SH1ALT" />
         </register>
         <register caption="ADC Input Mode Control Register 1" name="ADCIMCON1" offset="0x40" rw="RW" size="4">
            <bitfield caption="AN0 Signed Data Mode bit" mask="0x00000001" name="SIGN0" values="ADCIMCON1__SIGN0" />
            <bitfield caption="AN0 Mode bit" mask="0x00000002" name="DIFF0" values="ADCIMCON1__DIFF0" />
            <bitfield caption="AN1 Signed Data Mode bit" mask="0x00000004" name="SIGN1" values="ADCIMCON1__SIGN1" />
            <bitfield caption="AN1 Mode bit" mask="0x00000008" name="DIFF1" values="ADCIMCON1__DIFF1" />
            <bitfield caption="AN2 Signed Data Mode bit" mask="0x00000010" name="SIGN2" values="ADCIMCON1__SIGN2" />
            <bitfield caption="AN2 Mode bit" mask="0x00000020" name="DIFF2" values="ADCIMCON1__DIFF2" />
            <bitfield caption="AN3 Signed Data Mode bit" mask="0x00000040" name="SIGN3" values="ADCIMCON1__SIGN3" />
            <bitfield caption="AN3 Mode bit" mask="0x00000080" name="DIFF3" values="ADCIMCON1__DIFF3" />
            <bitfield caption="AN4 Signed Data Mode bit" mask="0x00000100" name="SIGN4" values="ADCIMCON1__SIGN4" />
            <bitfield caption="AN4 Mode bit" mask="0x00000200" name="DIFF4" values="ADCIMCON1__DIFF4" />
            <bitfield caption="AN5 Signed Data Mode bit" mask="0x00000400" name="SIGN5" values="ADCIMCON1__SIGN5" />
            <bitfield caption="AN5 Mode bit" mask="0x00000800" name="DIFF5" values="ADCIMCON1__DIFF5" />
            <bitfield caption="AN9 Signed Data Mode bit" mask="0x00040000" name="SIGN9" values="ADCIMCON1__SIGN9" />
            <bitfield caption="AN9 Mode bit" mask="0x00080000" name="DIFF9" values="ADCIMCON1__DIFF9" />
            <bitfield caption="AN12 Signed Data Mode bit" mask="0x01000000" name="SIGN12" values="ADCIMCON1__SIGN12" />
            <bitfield caption="AN12 Mode bit" mask="0x02000000" name="DIFF12" values="ADCIMCON1__DIFF12" />
            <bitfield caption="AN13 Signed Data Mode bit" mask="0x04000000" name="SIGN13" values="ADCIMCON1__SIGN13" />
            <bitfield caption="AN13 Mode bit" mask="0x08000000" name="DIFF13" values="ADCIMCON1__DIFF13" />
            <bitfield caption="AN15 Signed Data Mode bit" mask="0x40000000" name="SIGN15" values="ADCIMCON1__SIGN15" />
            <bitfield caption="AN15 Mode bit" mask="0x80000000" name="DIFF15" values="ADCIMCON1__DIFF15" />
         </register>
         <register caption="ADC Input Mode Control Register 2" name="ADCIMCON2" offset="0x50" rw="RW" size="4">
            <bitfield caption="AN16 Signed Data Mode bit" mask="0x00000001" name="SIGN16" values="ADCIMCON2__SIGN16" />
            <bitfield caption="AN16 Mode bit" mask="0x00000002" name="DIFF16" values="ADCIMCON2__DIFF16" />
            <bitfield caption="AN17 Signed Data Mode bit" mask="0x00000004" name="SIGN17" values="ADCIMCON2__SIGN17" />
            <bitfield caption="AN17 Mode bit" mask="0x00000008" name="DIFF17" values="ADCIMCON2__DIFF17" />
         </register>
         <register caption="ADC Global Interrupt Enable Register 1" name="ADCGIRQEN1" offset="0x80" rw="RW" size="4">
            <bitfield caption="ADC Global Interrupt Enable bit" mask="0x00000001" name="AGIEN0" values="ADCGIRQEN1__AGIEN0" />
            <bitfield caption="ADC Global Interrupt Enable bit" mask="0x00000002" name="AGIEN1" values="ADCGIRQEN1__AGIEN1" />
            <bitfield caption="ADC Global Interrupt Enable bit" mask="0x00000004" name="AGIEN2" values="ADCGIRQEN1__AGIEN2" />
            <bitfield caption="ADC Global Interrupt Enable bit" mask="0x00000008" name="AGIEN3" values="ADCGIRQEN1__AGIEN3" />
            <bitfield caption="ADC Global Interrupt Enable bit" mask="0x00000010" name="AGIEN4" values="ADCGIRQEN1__AGIEN4" />
            <bitfield caption="ADC Global Interrupt Enable bit" mask="0x00000020" name="AGIEN5" values="ADCGIRQEN1__AGIEN5" />
            <bitfield caption="ADC Global Interrupt Enable bit" mask="0x00000200" name="AGIEN9" values="ADCGIRQEN1__AGIEN9" />
            <bitfield caption="ADC Global Interrupt Enable bit" mask="0x00001000" name="AGIEN12" values="ADCGIRQEN1__AGIEN12" />
            <bitfield caption="ADC Global Interrupt Enable bit" mask="0x00002000" name="AGIEN13" values="ADCGIRQEN1__AGIEN13" />
            <bitfield caption="ADC Global Interrupt Enable bit" mask="0x00008000" name="AGIEN15" values="ADCGIRQEN1__AGIEN15" />
            <bitfield caption="ADC Global Interrupt Enable bit" mask="0x00010000" name="AGIEN16" values="ADCGIRQEN1__AGIEN16" />
            <bitfield caption="ADC Global Interrupt Enable bit" mask="0x00020000" name="AGIEN17" values="ADCGIRQEN1__AGIEN17" />
         </register>
         <register caption="ADC Global Interrupt Enable Register 2" name="ADCGIRQEN2" offset="0x90" rw="RW" size="4">
            <bitfield caption="ADC Global Interrupt Enable bit" mask="0x00040000" name="AGIEN50" values="ADCGIRQEN2__AGIEN50" />
            <bitfield caption="ADC Global Interrupt Enable bit" mask="0x00200000" name="AGIEN53" values="ADCGIRQEN2__AGIEN53" />
         </register>
