Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK-MC_DFP/1.11.151/atdf/PIC32MK0128MCA032.atdf
         <register caption="ADC Trigger Source 4 Register" name="ADCTRG4" offset="0x230" rw="RW" size="4">
            <bitfield caption="Trigger Source for Conversion of Analog Input AN12 Select bits" mask="0x0000001F" name="TRGSRC12" values="ADCTRG4__TRGSRC12" />
            <bitfield caption="Trigger Source for Conversion of Analog Input AN13 Select bits" mask="0x00001F00" name="TRGSRC13" values="ADCTRG4__TRGSRC13" />
            <bitfield caption="Trigger Source for Conversion of Analog Input AN15 Select bits" mask="0x1F000000" name="TRGSRC15" values="ADCTRG4__TRGSRC15" />
         </register>
         <register caption="ADC Trigger Source 5 Register" name="ADCTRG5" offset="0x240" rw="RW" size="4">
            <bitfield caption="Trigger Source for Conversion of Analog Input AN16 Select bits" mask="0x0000001F" name="TRGSRC16" values="ADCTRG5__TRGSRC16" />
            <bitfield caption="Trigger Source for Conversion of Analog Input AN17 Select bits" mask="0x00001F00" name="TRGSRC17" values="ADCTRG5__TRGSRC17" />
         </register>
         <register caption="ADC Digital Comparator 1 Control Register" name="ADCCMPCON1" offset="0x280" rw="RW" size="4">
            <bitfield caption="Low/Low Digital Comparator 0 Event bit" mask="0x00000001" name="IELOLO" values="ADCCMPCON1__IELOLO" />
            <bitfield caption="Low/High Digital Comparator 0 Event bit" mask="0x00000002" name="IELOHI" values="ADCCMPCON1__IELOHI" />
            <bitfield caption="High/Low Digital Comparator 0 Event bit" mask="0x00000004" name="IEHILO" values="ADCCMPCON1__IEHILO" />
            <bitfield caption="High/High Digital Comparator 0 Event bit" mask="0x00000008" name="IEHIHI" values="ADCCMPCON1__IEHIHI" />
            <bitfield caption="Between Low/High Digital Comparator 1 Event bit" mask="0x00000010" name="IEBTWN" values="ADCCMPCON1__IEBTWN" />
            <bitfield caption="Digital Comparator 1 Output True Event Status bit" mask="0x00000020" name="DCMPED" values="ADCCMPCON1__DCMPED" />
            <bitfield caption="Digital Comparator 1 Global Interrupt Enable bit" mask="0x00000040" name="DCMPGIEN" values="ADCCMPCON1__DCMPGIEN" />
            <bitfield caption="Digital Comparator 1 Enable bit" mask="0x00000080" name="ENDCMP" values="ADCCMPCON1__ENDCMP" />
            <bitfield caption="Digital Comparator 1 Analog Input Identification bits" mask="0x00003F00" name="AINID" values="ADCCMPCON1__AINID" />
         </register>
         <register caption="ADC Digital Comparator 'x' Control Register" name="ADCCMPCON2" offset="0x290" rw="RW" size="4">
            <bitfield caption="Low/Low Digital Comparator x Event bit" mask="0x00000001" name="IELOLO" values="ADCCMPCON2__IELOLO" />
            <bitfield caption="Low/High Digital Comparator x Event bit" mask="0x00000002" name="IELOHI" values="ADCCMPCON2__IELOHI" />
            <bitfield caption="High/Low Digital Comparator x Event bit" mask="0x00000004" name="IEHILO" values="ADCCMPCON2__IEHILO" />
            <bitfield caption="High/High Digital Comparator x Event bit" mask="0x00000008" name="IEHIHI" values="ADCCMPCON2__IEHIHI" />
            <bitfield caption="Between Low/High Digital Comparator x Event bit" mask="0x00000010" name="IEBTWN" values="ADCCMPCON2__IEBTWN" />
            <bitfield caption="Digital Comparator 'x' Output True Event Status bit" mask="0x00000020" name="DCMPED" values="ADCCMPCON2__DCMPED" />
            <bitfield caption="Digital Comparator 'x' Global Interrupt Enable bit" mask="0x00000040" name="DCMPGIEN" values="ADCCMPCON2__DCMPGIEN" />
            <bitfield caption="Digital Comparator 'x' Enable bit" mask="0x00000080" name="ENDCMP" values="ADCCMPCON2__ENDCMP" />
            <bitfield caption="Digital Comparator 'x' Analog Input Identification bits" mask="0x00001F00" name="AINID" values="ADCCMPCON2__AINID" />
         </register>
         <register caption="ADC Base Register" name="ADCBASE" offset="0x300" rw="RW" size="4">
            <bitfield caption="" mask="0x0000FFFF" name="ADCBASE" />
         </register>
         <register caption="ADC DMA Status Register" name="ADCDSTAT" offset="0x310" rw="RW" size="4">
            <bitfield caption="RAM DMA Ping-Pong Buffer A Full Status bits for ADC0" mask="0x00000001" name="RAF0" values="ADCDSTAT__RAF0" />
            <bitfield caption="RAM DMA Ping-Pong Buffer A Full Status bits for ADC1" mask="0x00000002" name="RAF1" values="ADCDSTAT__RAF1" />
            <bitfield caption="RAM DMA Buffer A Full Interrupt Enable bits for ADC0" mask="0x00000100" name="RAFIEN0" values="ADCDSTAT__RAFIEN0" />
            <bitfield caption="RAM DMA Buffer A Full Interrupt Enable bits for ADC1" mask="0x00000200" name="RAFIEN1" values="ADCDSTAT__RAFIEN1" />
            <bitfield caption="" mask="0x00008000" name="DMACEN" />
            <bitfield caption="RAM DMA Buffer B Full Status bits for ADC0" mask="0x00010000" name="RBF0" values="ADCDSTAT__RBF0" />
            <bitfield caption="RAM DMA Buffer B Full Status bits for ADC1" mask="0x00020000" name="RBF1" values="ADCDSTAT__RBF1" />
            <bitfield caption="" mask="0x00800000" name="WOVERR" />
            <bitfield caption="RAM DMA Buffer B Full Interrupt Enable bits for ADC0" mask="0x01000000" name="RBFIEN0" values="ADCDSTAT__RBFIEN0" />
            <bitfield caption="RAM DMA Buffer B Full Interrupt Enable bits for ADC1" mask="0x02000000" name="RBFIEN1" values="ADCDSTAT__RBFIEN1" />
            <bitfield caption="Global ADC DMA Enable bit" mask="0x80000000" name="DMAEN" values="ADCDSTAT__DMAEN" />
         </register>
         <register caption="ADC Channel Sample Count Base Address Register" name="ADCCNTB" offset="0x320" rw="RW" size="4">
            <bitfield caption="" mask="0xFFFFFFFF" name="ADCCNTB" />
         </register>
         <register caption="ADC Channel Sample Count Base Address Register" name="ADCDMAB" offset="0x330" rw="RW" size="4">
            <bitfield caption="" mask="0xFFFFFFFF" name="ADCDMAB" />
         </register>
         <register caption="ADC Trigger Level/Edge Sensitivity Register" name="ADCTRGSNS" offset="0x340" rw="RW" size="4">
            <bitfield caption="Trigger Level and Edge Sensitivity bits" mask="0x00000001" name="LVL0" values="ADCTRGSNS__LVL0" />
            <bitfield caption="Trigger Level and Edge Sensitivity bits" mask="0x00000002" name="LVL1" values="ADCTRGSNS__LVL1" />
            <bitfield caption="Trigger Level and Edge Sensitivity bits" mask="0x00000004" name="LVL2" values="ADCTRGSNS__LVL2" />
            <bitfield caption="Trigger Level and Edge Sensitivity bits" mask="0x00000008" name="LVL3" values="ADCTRGSNS__LVL3" />
            <bitfield caption="Trigger Level and Edge Sensitivity bits" mask="0x00000010" name="LVL4" values="ADCTRGSNS__LVL4" />
            <bitfield caption="Trigger Level and Edge Sensitivity bits" mask="0x00000020" name="LVL5" values="ADCTRGSNS__LVL5" />
            <bitfield caption="Trigger Level and Edge Sensitivity bits" mask="0x00000200" name="LVL9" values="ADCTRGSNS__LVL9" />
            <bitfield caption="Trigger Level and Edge Sensitivity bits" mask="0x00001000" name="LVL12" values="ADCTRGSNS__LVL12" />
            <bitfield caption="Trigger Level and Edge Sensitivity bits" mask="0x00002000" name="LVL13" values="ADCTRGSNS__LVL13" />
            <bitfield caption="Trigger Level and Edge Sensitivity bits" mask="0x00008000" name="LVL15" values="ADCTRGSNS__LVL15" />
            <bitfield caption="Trigger Level and Edge Sensitivity bits" mask="0x00010000" name="LVL16" values="ADCTRGSNS__LVL16" />
            <bitfield caption="Trigger Level and Edge Sensitivity bits" mask="0x00020000" name="LVL17" values="ADCTRGSNS__LVL17" />
         </register>
