Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK-MC_DFP/1.11.151/atdf/PIC32MK0128MCA032.atdf
         <register caption="" name="ADCDATA5" offset="0x650" rw="RW" size="4">
            <bitfield caption="" mask="0xFFFFFFFF" name="DATA" />
         </register>
         <register caption="" name="ADCDATA9" offset="0x690" rw="RW" size="4">
            <bitfield caption="" mask="0xFFFFFFFF" name="DATA" />
         </register>
         <register caption="" name="ADCDATA12" offset="0x6c0" rw="RW" size="4">
            <bitfield caption="" mask="0xFFFFFFFF" name="DATA" />
         </register>
         <register caption="" name="ADCDATA13" offset="0x6d0" rw="RW" size="4">
            <bitfield caption="" mask="0xFFFFFFFF" name="DATA" />
         </register>
         <register caption="" name="ADCDATA15" offset="0x6f0" rw="RW" size="4">
            <bitfield caption="" mask="0xFFFFFFFF" name="DATA" />
         </register>
         <register caption="" name="ADCDATA16" offset="0x700" rw="RW" size="4">
            <bitfield caption="" mask="0xFFFFFFFF" name="DATA" />
         </register>
         <register caption="" name="ADCDATA17" offset="0x710" rw="RW" size="4">
            <bitfield caption="" mask="0xFFFFFFFF" name="DATA" />
         </register>
         <register caption="" name="ADCDATA50" offset="0x920" rw="RW" size="4">
            <bitfield caption="" mask="0xFFFFFFFF" name="DATA" />
         </register>
         <register caption="" name="ADCDATA53" offset="0x950" rw="RW" size="4">
            <bitfield caption="" mask="0xFFFFFFFF" name="DATA" />
         </register>
         <register caption="" name="ADC0CFG" offset="0xd00" rw="RW" size="4">
            <bitfield caption="" mask="0xFFFFFFFF" name="ADCCFG" />
         </register>
         <register caption="" name="ADC1CFG" offset="0xd10" rw="RW" size="4">
            <bitfield caption="" mask="0xFFFFFFFF" name="ADCCFG" />
         </register>
         <register caption="" name="ADC7CFG" offset="0xd70" rw="RW" size="4">
            <bitfield caption="" mask="0xFFFFFFFF" name="ADCCFG" />
         </register>
         <register caption="" name="ADCSYSCFG0" offset="0xe00" rw="R" size="4">
            <bitfield caption="" mask="0x00000001" name="AN0" />
            <bitfield caption="" mask="0x00000002" name="AN1" />
            <bitfield caption="" mask="0x00000004" name="AN2" />
            <bitfield caption="" mask="0x00000008" name="AN3" />
            <bitfield caption="" mask="0x00000010" name="AN4" />
            <bitfield caption="" mask="0x00000020" name="AN5" />
            <bitfield caption="" mask="0x00000200" name="AN9" />
            <bitfield caption="" mask="0x00001000" name="AN12" />
            <bitfield caption="" mask="0x00002000" name="AN13" />
            <bitfield caption="" mask="0x00008000" name="AN15" />
            <bitfield caption="" mask="0x00010000" name="AN16" />
            <bitfield caption="" mask="0x00020000" name="AN17" />
         </register>
         <register caption="" name="ADCSYSCFG1" offset="0xe10" rw="R" size="4">
            <bitfield caption="" mask="0x00040000" name="AN50" />
            <bitfield caption="" mask="0x00200000" name="AN53" />
         </register>
      </register-group>
      <value-group caption="DMA to System RAM Buffer Length Size bits" name="ADCCON1__DMABL">
         <value caption="Allocates 128 locations in system memory to each analog input" name="" value="0x7" />
         <value caption="Allocates 64 locations in system memory to each analog input" name="" value="0x6" />
         <value caption="Allocates 32 locations in system memory to each analog input" name="" value="0x5" />
         <value caption="Allocates 16 locations in system memory to each analog input" name="" value="0x4" />
         <value caption="Allocates 8 locations in system memory to each analog input" name="" value="0x3" />
         <value caption="Allocates 4 locations in system memory to each analog input" name="" value="0x2" />
         <value caption="Allocates 2 locations in system memory to each analog input" name="" value="0x1" />
         <value caption="Allocates 1 location in system memory to each analog input" name="" value="0x0" />
      </value-group>
      <value-group caption="Scan Trigger High Level/Positive Edge Sensitivity bit" name="ADCCON1__STRGLVL">
         <value caption="Scan trigger is high level sensitive. Once STRIG mode is selected the scan trigger will continue for all selected analog inputs" name="" value="0x1" />
         <value caption="Scan trigger is positive edge sensitive. Once STRIG mode is selected only a single scan trigger will be generated which will complete the scan of all selected analog inputs. (TRGSRCx in the ADCTRGx register)" name="" value="0x0" />
      </value-group>
      <value-group caption="Interrupt Vector Shift bits" name="ADCCON1__IRQVS">
         <value caption="Shift x left 7 bit position" name="" value="0x7" />
         <value caption="Shift x left 6 bit position" name="" value="0x6" />
         <value caption="Shift x left 5 bit position" name="" value="0x5" />
         <value caption="Shift x left 4 bit position" name="" value="0x4" />
         <value caption="Shift x left 3 bit position" name="" value="0x3" />
         <value caption="Shift x left 2 bit position" name="" value="0x2" />
         <value caption="Shift x left 1 bit position" name="" value="0x1" />
         <value caption="Shift x left 0 bit position" name="" value="0x0" />
      </value-group>
      <value-group caption="Bypass Fast Synchronous Peripheral Bus Clock to ADC Control Clock" name="ADCCON1__FSPBCLKEN">
         <value caption="Bypass synchronizer logic for peripheral clock to ADC control clocks" name="" value="0x1" />
         <value caption="Enable clock synchronizers for non-synchronized peripheral clock to ADC control clocks" name="" value="0x0" />
      </value-group>
      <value-group caption="Bypass Fast Synchronous DMA System Clock to ADC Control Clock" name="ADCCON1__FSSCLKEN">
         <value caption="Bypass synchronizer logic for DMA system clock to ADC control clocks" name="" value="0x1" />
         <value caption="Enable clock synchronizers for non-synchronized DMA to ADC clock sources" name="" value="0x0" />
      </value-group>
      <value-group caption="Capacitive Voltage Division Enable bit" name="ADCCON1__CVDEN">
         <value caption="CVD operation is enabled" name="" value="0x1" />
         <value caption="CVD operation is disabled" name="" value="0x0" />
      </value-group>
      <value-group caption="Analog Input Charge Pump Enable bit" name="ADCCON1__AICPMPEN">
         <value caption="Analog input charge pump is enabled" name="" value="0x1" />
         <value caption="Analog input charge pump is disabled (default)" name="" value="0x0" />
      </value-group>
      <value-group caption="Stop in Idle Mode bit" name="ADCCON1__SIDL">
         <value caption="Discontinue module operation when device enters Idle mode" name="" value="0x1" />
         <value caption="Continue module operation in Idle mode" name="" value="0x0" />
      </value-group>
