Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK-MC_DFP/1.11.151/atdf/PIC32MK0128MCA032.atdf
      <value-group caption="Global Software Trigger bit" name="ADCCON3__GSWTRG">
         <value caption="Trigger conversion for ADC inputs that have selected the GSWTRG bit as either through the associated TRGSRC bits in the ADCTRGx registers or through the STRGSRC(4:0) bits in the ADCCON1 register the trigger signal" name="" value="0x1" />
      </value-group>
      <value-group caption="Global Level Software Trigger bit" name="ADCCON3__GLSWTRG">
         <value caption="Trigger conversion for ADC inputs that have selected the GLSWTRG bit as the trigger signal" name="" value="0x1" />
         <value caption="Do not trigger an analog-to-digital conversion" name="" value="0x0" />
      </value-group>
      <value-group caption="Individual ADC Input Conversion Request bit" name="ADCCON3__RQCNVRT">
         <value caption="Trigger the conversion of the selected ADC input as specified by the ADINSEL bits" name="" value="0x1" />
         <value caption="Do not trigger the conversion" name="" value="0x0" />
      </value-group>
      <value-group caption="Shared ADC7 Analog Input Sampling Enable bit " name="ADCCON3__SAMP">
         <value caption="The ADC S&amp;H amplifier is sampling" name="" value="0x1" />
         <value caption="The ADC S&amp;H amplifier is holding" name="" value="0x0" />
      </value-group>
      <value-group caption="ADC Update Ready Status bit" name="ADCCON3__UPDRDY">
         <value caption="ADC SFRs can be updated" name="" value="0x1" />
         <value caption="ADC SFRs cannot be updated" name="" value="0x0" />
      </value-group>
      <value-group caption="Update Ready Interrupt Enable bit" name="ADCCON3__UPDIEN">
         <value caption="Interrupt will be generated when the UPDRDY bit is set by hardware" name="" value="0x1" />
         <value caption="No interrupt is generated" name="" value="0x0" />
      </value-group>
      <value-group caption="Trigger Suspend bit" name="ADCCON3__TRGSUSP">
         <value caption="Triggers are blocked from starting a new analog-to-digital conversion" name="" value="0x1" />
         <value caption="Triggers are not blocked" name="" value="0x0" />
      </value-group>
      <value-group caption="Voltage Reference Input Selection bits" name="ADCCON3__VREFSEL">
         <value caption="ADC VREFH is VREF+, ADC VREFL is VREF-" name="" value="0x3" />
         <value caption="ADC VREFH is AVDD, ADC VREFL is VREF-" name="" value="0x2" />
         <value caption="ADC VREFH is VREF+, ADC VREFL is AVSS" name="" value="0x1" />
         <value caption="ADC VREFH is AVDD, ADC VREFL is AVSS" name="" value="0x0" />
      </value-group>
      <value-group caption="ADC0 Digital Enable bit" name="ADCCON3__DIGEN0">
         <value caption="ADC0 is digital enabled (required for active operation)" name="" value="0x1" />
         <value caption="ADC0 is digital disabled (power-saving mode)" name="" value="0x0" />
      </value-group>
      <value-group caption="ADC1 Digital Enable bit" name="ADCCON3__DIGEN1">
         <value caption="ADC1 is digital enabled (required for active operation)" name="" value="0x1" />
         <value caption="ADC1 is digital disabled (power-saving mode)" name="" value="0x0" />
      </value-group>
      <value-group caption="ADC2 Digital Enable bit" name="ADCCON3__DIGEN7">
         <value caption="ADC2 is digital enabled (required for active operation)" name="" value="0x1" />
         <value caption="ADC2 is digital disabled (power-saving mode)" name="" value="0x0" />
      </value-group>
      <value-group caption="Analog-to-Digital Control Clock Divider bits" name="ADCCON3__CONCLKDIV">
         <value caption="126 * Tclk = Tq" name="" value="0x3f" />
         <value caption="6 * Tclk = Tq" name="" value="0x3" />
         <value caption="4 * Tclk = Tq" name="" value="0x2" />
         <value caption="2 * Tclk = Tq" name="" value="0x1" />
         <value caption="Tclk = Tq" name="" value="0x0" />
      </value-group>
      <value-group caption="Analog-to-Digital Clock Source bits" name="ADCCON3__ADCSEL">
         <value caption="SYSCLK (Required if using DMA for ADC)" name="" value="0x3" />
         <value caption="REFCLK3" name="" value="0x2" />
         <value caption="FRC" name="" value="0x1" />
         <value caption="SYSCLK" name="" value="0x0" />
      </value-group>
      <value-group caption="ADC0 Synchronous Sampling bit" name="ADCTRGMODE__SSAMPEN0">
         <value caption="ADC0 uses synchronous sampling for the first sample after being idle or disabled" name="" value="0x1" />
         <value caption="ADC0 does not use synchronous sampling" name="" value="0x0" />
      </value-group>
      <value-group caption="ADC1 Synchronous Sampling bit" name="ADCTRGMODE__SSAMPEN1">
         <value caption="ADC1 uses synchronous sampling for the first sample after being idle or disabled" name="" value="0x1" />
         <value caption="ADC1 does not use synchronous sampling" name="" value="0x0" />
      </value-group>
      <value-group caption="ADC0 Presynchronized Triggers bit" name="ADCTRGMODE__STRGEN0">
         <value caption="ADC0 uses presynchronized triggers" name="" value="0x1" />
         <value caption="ADC0 does not use presynchronized triggers" name="" value="0x0" />
      </value-group>
      <value-group caption="ADC1 Presynchronized Triggers bit" name="ADCTRGMODE__STRGEN1">
         <value caption="ADC1 uses presynchronized triggers" name="" value="0x1" />
         <value caption="ADC1 does not use presynchronized triggers" name="" value="0x0" />
      </value-group>
      <value-group caption="ADC0 Analog Input Select bit" name="ADCTRGMODE__SH0ALT">
         <value caption="AN6" name="" value="0x3" />
         <value caption="AN4" name="" value="0x2" />
         <value caption="AN13" name="" value="0x1" />
         <value caption="AN0" name="" value="0x0" />
      </value-group>
      <value-group caption="ADC1 Analog Input Select bit" name="ADCTRGMODE__SH1ALT">
         <value caption="AN16" name="" value="0x3" />
         <value caption="AN5" name="" value="0x2" />
         <value caption="AN3" name="" value="0x1" />
         <value caption="AN1" name="" value="0x0" />
      </value-group>
