Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK-MC_DFP/1.11.151/atdf/PIC32MK0128MCA032.atdf
      <value-group caption="Analog Common Scan Select bits" name="ADCCSS1__CSS6">
         <value caption="Select ANx for input scan (i.e.ANx = CSSx and scan is sequential starting with the lowest to highest enabled CSSx analog input pin)" name="" value="0x1" />
         <value caption="Skip ANx for input scan" name="" value="0x0" />
      </value-group>
      <value-group caption="Analog Common Scan Select bits" name="ADCCSS1__CSS7">
         <value caption="Select ANx for input scan (i.e.ANx = CSSx and scan is sequential starting with the lowest to highest enabled CSSx analog input pin)" name="" value="0x1" />
         <value caption="Skip ANx for input scan" name="" value="0x0" />
      </value-group>
      <value-group caption="Analog Common Scan Select bits" name="ADCCSS1__CSS8">
         <value caption="Select ANx for input scan (i.e.ANx = CSSx and scan is sequential starting with the lowest to highest enabled CSSx analog input pin)" name="" value="0x1" />
         <value caption="Skip ANx for input scan" name="" value="0x0" />
      </value-group>
      <value-group caption="Analog Common Scan Select bits" name="ADCCSS1__CSS9">
         <value caption="Select ANx for input scan (i.e.ANx = CSSx and scan is sequential starting with the lowest to highest enabled CSSx analog input pin)" name="" value="0x1" />
         <value caption="Skip ANx for input scan" name="" value="0x0" />
      </value-group>
      <value-group caption="Analog Common Scan Select bits" name="ADCCSS1__CSS10">
         <value caption="Select ANx for input scan (i.e.ANx = CSSx and scan is sequential starting with the lowest to highest enabled CSSx analog input pin)" name="" value="0x1" />
         <value caption="Skip ANx for input scan" name="" value="0x0" />
      </value-group>
      <value-group caption="Analog Common Scan Select bits" name="ADCCSS1__CSS11">
         <value caption="Select ANx for input scan (i.e.ANx = CSSx and scan is sequential starting with the lowest to highest enabled CSSx analog input pin)" name="" value="0x1" />
         <value caption="Skip ANx for input scan" name="" value="0x0" />
      </value-group>
      <value-group caption="Analog Common Scan Select bits" name="ADCCSS1__CSS12">
         <value caption="Select ANx for input scan (i.e.ANx = CSSx and scan is sequential starting with the lowest to highest enabled CSSx analog input pin)" name="" value="0x1" />
         <value caption="Skip ANx for input scan" name="" value="0x0" />
      </value-group>
      <value-group caption="Analog Common Scan Select bits" name="ADCCSS1__CSS13">
         <value caption="Select ANx for input scan (i.e.ANx = CSSx and scan is sequential starting with the lowest to highest enabled CSSx analog input pin)" name="" value="0x1" />
         <value caption="Skip ANx for input scan" name="" value="0x0" />
      </value-group>
      <value-group caption="Analog Common Scan Select bits" name="ADCCSS1__CSS14">
         <value caption="Select ANx for input scan (i.e.ANx = CSSx and scan is sequential starting with the lowest to highest enabled CSSx analog input pin)" name="" value="0x1" />
         <value caption="Skip ANx for input scan" name="" value="0x0" />
      </value-group>
      <value-group caption="Analog Common Scan Select bits" name="ADCCSS1__CSS15">
         <value caption="Select ANx for input scan (i.e.ANx = CSSx and scan is sequential starting with the lowest to highest enabled CSSx analog input pin)" name="" value="0x1" />
         <value caption="Skip ANx for input scan" name="" value="0x0" />
      </value-group>
      <value-group caption="Analog Common Scan Select bits" name="ADCCSS1__CSS16">
         <value caption="Select ANx for input scan (i.e.ANx = CSSx and scan is sequential starting with the lowest to highest enabled CSSx analog input pin)" name="" value="0x1" />
         <value caption="Skip ANx for input scan" name="" value="0x0" />
      </value-group>
      <value-group caption="Analog Common Scan Select bits" name="ADCCSS1__CSS17">
         <value caption="Select ANx for input scan (i.e.ANx = CSSx and scan is sequential starting with the lowest to highest enabled CSSx analog input pin)" name="" value="0x1" />
         <value caption="Skip ANx for input scan" name="" value="0x0" />
      </value-group>
      <value-group caption="Analog Common Scan Select bits" name="ADCCSS2__CSS50">
         <value caption="Select ANx for input scan (i.e.ANx = CSSx and scan is sequential starting with the lowest to highest enabled CSSx analog input pin)" name="" value="0x1" />
         <value caption="Skip ANx for input scan" name="" value="0x0" />
      </value-group>
      <value-group caption="Analog Common Scan Select bits" name="ADCCSS2__CSS53">
         <value caption="Select ANx for input scan (i.e.ANx = CSSx and scan is sequential starting with the lowest to highest enabled CSSx analog input pin)" name="" value="0x1" />
         <value caption="Skip ANx for input scan" name="" value="0x0" />
      </value-group>
      <value-group caption="Conversion Data Ready for Corresponding Analog Input Ready bits" name="ADCDSTAT1__ARDY0">
         <value caption="This bit is set when converted data is ready in the data register" name="" value="0x1" />
         <value caption="This bit is cleared when the associated data register is read" name="" value="0x0" />
      </value-group>
      <value-group caption="Conversion Data Ready for Corresponding Analog Input Ready bits" name="ADCDSTAT1__ARDY1">
         <value caption="This bit is set when converted data is ready in the data register" name="" value="0x1" />
         <value caption="This bit is cleared when the associated data register is read" name="" value="0x0" />
      </value-group>
      <value-group caption="Conversion Data Ready for Corresponding Analog Input Ready bits" name="ADCDSTAT1__ARDY2">
         <value caption="This bit is set when converted data is ready in the data register" name="" value="0x1" />
         <value caption="This bit is cleared when the associated data register is read" name="" value="0x0" />
      </value-group>
      <value-group caption="Conversion Data Ready for Corresponding Analog Input Ready bits" name="ADCDSTAT1__ARDY3">
         <value caption="This bit is set when converted data is ready in the data register" name="" value="0x1" />
         <value caption="This bit is cleared when the associated data register is read" name="" value="0x0" />
      </value-group>
      <value-group caption="Conversion Data Ready for Corresponding Analog Input Ready bits" name="ADCDSTAT1__ARDY4">
         <value caption="This bit is set when converted data is ready in the data register" name="" value="0x1" />
         <value caption="This bit is cleared when the associated data register is read" name="" value="0x0" />
      </value-group>
