Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK-MC_DFP/1.11.151/atdf/PIC32MK0128MCA032.atdf
      <value-group caption="Trigger Level and Edge Sensitivity bits" name="ADCTRGSNS__LVL3">
         <value caption="Analog input is sensitive to the high level of its trigger (level sensitivity implies retriggering as long as the trigger signal remains high)" name="" value="0x1" />
         <value caption="Analog input is sensitive to the positive edge of its trigger (this is the value after a reset)" name="" value="0x0" />
      </value-group>
      <value-group caption="Trigger Level and Edge Sensitivity bits" name="ADCTRGSNS__LVL4">
         <value caption="Analog input is sensitive to the high level of its trigger (level sensitivity implies retriggering as long as the trigger signal remains high)" name="" value="0x1" />
         <value caption="Analog input is sensitive to the positive edge of its trigger (this is the value after a reset)" name="" value="0x0" />
      </value-group>
      <value-group caption="Trigger Level and Edge Sensitivity bits" name="ADCTRGSNS__LVL5">
         <value caption="Analog input is sensitive to the high level of its trigger (level sensitivity implies retriggering as long as the trigger signal remains high)" name="" value="0x1" />
         <value caption="Analog input is sensitive to the positive edge of its trigger (this is the value after a reset)" name="" value="0x0" />
      </value-group>
      <value-group caption="Trigger Level and Edge Sensitivity bits" name="ADCTRGSNS__LVL6">
         <value caption="Analog input is sensitive to the high level of its trigger (level sensitivity implies retriggering as long as the trigger signal remains high)" name="" value="0x1" />
         <value caption="Analog input is sensitive to the positive edge of its trigger (this is the value after a reset)" name="" value="0x0" />
      </value-group>
      <value-group caption="Trigger Level and Edge Sensitivity bits" name="ADCTRGSNS__LVL7">
         <value caption="Analog input is sensitive to the high level of its trigger (level sensitivity implies retriggering as long as the trigger signal remains high)" name="" value="0x1" />
         <value caption="Analog input is sensitive to the positive edge of its trigger (this is the value after a reset)" name="" value="0x0" />
      </value-group>
      <value-group caption="Trigger Level and Edge Sensitivity bits" name="ADCTRGSNS__LVL8">
         <value caption="Analog input is sensitive to the high level of its trigger (level sensitivity implies retriggering as long as the trigger signal remains high)" name="" value="0x1" />
         <value caption="Analog input is sensitive to the positive edge of its trigger (this is the value after a reset)" name="" value="0x0" />
      </value-group>
      <value-group caption="Trigger Level and Edge Sensitivity bits" name="ADCTRGSNS__LVL9">
         <value caption="Analog input is sensitive to the high level of its trigger (level sensitivity implies retriggering as long as the trigger signal remains high)" name="" value="0x1" />
         <value caption="Analog input is sensitive to the positive edge of its trigger (this is the value after a reset)" name="" value="0x0" />
      </value-group>
      <value-group caption="Trigger Level and Edge Sensitivity bits" name="ADCTRGSNS__LVL10">
         <value caption="Analog input is sensitive to the high level of its trigger (level sensitivity implies retriggering as long as the trigger signal remains high)" name="" value="0x1" />
         <value caption="Analog input is sensitive to the positive edge of its trigger (this is the value after a reset)" name="" value="0x0" />
      </value-group>
      <value-group caption="Trigger Level and Edge Sensitivity bits" name="ADCTRGSNS__LVL11">
         <value caption="Analog input is sensitive to the high level of its trigger (level sensitivity implies retriggering as long as the trigger signal remains high)" name="" value="0x1" />
         <value caption="Analog input is sensitive to the positive edge of its trigger (this is the value after a reset)" name="" value="0x0" />
      </value-group>
      <value-group caption="Trigger Level and Edge Sensitivity bits" name="ADCTRGSNS__LVL12">
         <value caption="Analog input is sensitive to the high level of its trigger (level sensitivity implies retriggering as long as the trigger signal remains high)" name="" value="0x1" />
         <value caption="Analog input is sensitive to the positive edge of its trigger (this is the value after a reset)" name="" value="0x0" />
      </value-group>
      <value-group caption="Trigger Level and Edge Sensitivity bits" name="ADCTRGSNS__LVL13">
         <value caption="Analog input is sensitive to the high level of its trigger (level sensitivity implies retriggering as long as the trigger signal remains high)" name="" value="0x1" />
         <value caption="Analog input is sensitive to the positive edge of its trigger (this is the value after a reset)" name="" value="0x0" />
      </value-group>
      <value-group caption="Trigger Level and Edge Sensitivity bits" name="ADCTRGSNS__LVL14">
         <value caption="Analog input is sensitive to the high level of its trigger (level sensitivity implies retriggering as long as the trigger signal remains high)" name="" value="0x1" />
         <value caption="Analog input is sensitive to the positive edge of its trigger (this is the value after a reset)" name="" value="0x0" />
      </value-group>
      <value-group caption="Trigger Level and Edge Sensitivity bits" name="ADCTRGSNS__LVL15">
         <value caption="Analog input is sensitive to the high level of its trigger (level sensitivity implies retriggering as long as the trigger signal remains high)" name="" value="0x1" />
         <value caption="Analog input is sensitive to the positive edge of its trigger (this is the value after a reset)" name="" value="0x0" />
      </value-group>
      <value-group caption="Trigger Level and Edge Sensitivity bits" name="ADCTRGSNS__LVL16">
         <value caption="Analog input is sensitive to the high level of its trigger (level sensitivity implies retriggering as long as the trigger signal remains high)" name="" value="0x1" />
         <value caption="Analog input is sensitive to the positive edge of its trigger (this is the value after a reset)" name="" value="0x0" />
      </value-group>
      <value-group caption="Trigger Level and Edge Sensitivity bits" name="ADCTRGSNS__LVL17">
         <value caption="Analog input is sensitive to the high level of its trigger (level sensitivity implies retriggering as long as the trigger signal remains high)" name="" value="0x1" />
         <value caption="Analog input is sensitive to the positive edge of its trigger (this is the value after a reset)" name="" value="0x0" />
      </value-group>
      <value-group caption="ADCx Sample Time bits" name="ADC0TIME__SAMC">
         <value caption="1025 TADx" name="" value="0x3ff" />
         <value caption="3 TADx" name="" value="0x1" />
         <value caption="2 TADx" name="" value="0x0" />
      </value-group>
      <value-group caption="ADCx Clock Divisor bits" name="ADC0TIME__ADCDIV">
         <value caption="254 * TQ = TADx" name="" value="0x7f" />
         <value caption="6 * TQ = TADx" name="" value="0x3" />
         <value caption="4 * TQ = TADx" name="" value="0x2" />
         <value caption="2 * TQ = TADx" name="" value="0x1" />
         <value caption="Reserved" name="" value="0x0" />
      </value-group>
      <value-group caption="Buffer Channel Enable bit" name="ADC0TIME__BCHEN">
         <value caption="ADC data saved in DMA system ram buffer when DMAEN (ADCDSTAT) = 1" name="" value="0x1" />
         <value caption="ADC data must be read by CPU from appropriate ADC result register" name="" value="0x0" />
      </value-group>
      <value-group caption="ADCx Resolution Select bits" name="ADC0TIME__SELRES">
         <value caption="12 bits" name="" value="0x3" />
         <value caption="10 bits" name="" value="0x2" />
         <value caption="8 bits" name="" value="0x1" />
         <value caption="6 bits" name="" value="0x0" />
      </value-group>
