Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK-MC_DFP/1.11.151/atdf/PIC32MK0128MCA032.atdf
      <value-group caption="Early Interrupt for Corresponding Analog Input Ready bits" name="ADCEISTAT1__EIRDY16">
         <value caption="This bit is set when the early interrupt event occurs for the specified analog input. An interrupt will be generated if early interrupts are enabled in the ADCEIEN1 register. For the Class 1 analog inputs this bit will set as per the configuration of the ADCEIS bits in the ADCxTIME register. For the shared ADC module this bit will be set as per the configuration of the ADCEIS(2:0) bits in the ADCCON2 register." name="" value="0x1" />
         <value caption="Interrupts are disabled" name="" value="0x0" />
      </value-group>
      <value-group caption="Early Interrupt for Corresponding Analog Input Ready bits" name="ADCEISTAT1__EIRDY17">
         <value caption="This bit is set when the early interrupt event occurs for the specified analog input. An interrupt will be generated if early interrupts are enabled in the ADCEIEN1 register. For the Class 1 analog inputs this bit will set as per the configuration of the ADCEIS bits in the ADCxTIME register. For the shared ADC module this bit will be set as per the configuration of the ADCEIS(2:0) bits in the ADCCON2 register." name="" value="0x1" />
         <value caption="Interrupts are disabled" name="" value="0x0" />
      </value-group>
      <value-group caption="Early Interrupt for Corresponding Analog Input Ready bits" name="ADCEISTAT2__EIRDY50">
         <value caption="This bit is set when the early interrupt event occurs for the specified analog input. An interrupt will be generated if early interrupts are enabled in the ADCEIEN1 register. For the Class 1 analog inputs this bit will set as per the configuration of the ADCEIS bits in the ADCxTIME register. For the shared ADC module this bit will be set as per the configuration of the ADCEIS(2:0) bits in the ADCCON2 register." name="" value="0x1" />
         <value caption="Interrupts are disabled" name="" value="0x0" />
      </value-group>
      <value-group caption="Early Interrupt for Corresponding Analog Input Ready bits" name="ADCEISTAT2__EIRDY53">
         <value caption="This bit is set when the early interrupt event occurs for the specified analog input. An interrupt will be generated if early interrupts are enabled in the ADCEIEN1 register. For the Class 1 analog inputs this bit will set as per the configuration of the ADCEIS bits in the ADCxTIME register. For the shared ADC module this bit will be set as per the configuration of the ADCEIS(2:0) bits in the ADCCON2 register." name="" value="0x1" />
         <value caption="Interrupts are disabled" name="" value="0x0" />
      </value-group>
      <value-group caption="ADC Analog and Bias Circuitry Enable bits" name="ADCANCON__ANEN0">
         <value caption="Analog and bias circuitry enabled. Once the analog and bias circuit is enabled the ADC module needs a warm-up time as defined by the WKUPCLKCNT bits." name="" value="0x1" />
         <value caption="Analog and bias circuitry disabled" name="" value="0x0" />
      </value-group>
      <value-group caption="ADC Analog and Bias Circuitry Enable bits" name="ADCANCON__ANEN1">
         <value caption="Analog and bias circuitry enabled. Once the analog and bias circuit is enabled the ADC module needs a warm-up time as defined by the WKUPCLKCNT bits." name="" value="0x1" />
         <value caption="Analog and bias circuitry disabled" name="" value="0x0" />
      </value-group>
      <value-group caption="ADC Analog and Bias Circuitry Enable bits" name="ADCANCON__ANEN7">
         <value caption="Analog and bias circuitry enabled. Once the analog and bias circuit is enabled the ADC module needs a warm-up time as defined by the WKUPCLKCNT bits." name="" value="0x1" />
         <value caption="Analog and bias circuitry disabled" name="" value="0x0" />
      </value-group>
      <value-group caption="ADC5-ADC0 Wake-up Status bit" name="ADCANCON__WKRDY0">
         <value caption="ADCx Analog and Bias circuitry ready after the wake-up count number 2WKUPEXP clocks after setting ANENx to 1" name="" value="0x1" />
         <value caption="ADCx Analog and Bias circuitry is not ready" name="" value="0x0" />
      </value-group>
      <value-group caption="ADC5-ADC0 Wake-up Status bit" name="ADCANCON__WKRDY1">
         <value caption="ADCx Analog and Bias circuitry ready after the wake-up count number 2WKUPEXP clocks after setting ANENx to 1" name="" value="0x1" />
         <value caption="ADCx Analog and Bias circuitry is not ready" name="" value="0x0" />
      </value-group>
      <value-group caption="ADC5-ADC0 Wake-up Status bit" name="ADCANCON__WKRDY7">
         <value caption="ADCx Analog and Bias circuitry ready after the wake-up count number 2WKUPEXP clocks after setting ANENx to 1" name="" value="0x1" />
         <value caption="ADCx Analog and Bias circuitry is not ready" name="" value="0x0" />
      </value-group>
      <value-group caption="ADC Wake-up Interrupt Enable bit" name="ADCANCON__WKIEN0">
         <value caption="Enable interrupt and generate interrupt when the WKRDYx status bit is set" name="" value="0x1" />
         <value caption="Disable interrupt" name="" value="0x0" />
      </value-group>
      <value-group caption="ADC Wake-up Interrupt Enable bit" name="ADCANCON__WKIEN1">
         <value caption="Enable interrupt and generate interrupt when the WKRDYx status bit is set" name="" value="0x1" />
         <value caption="Disable interrupt" name="" value="0x0" />
      </value-group>
      <value-group caption="ADC Wake-up Interrupt Enable bit" name="ADCANCON__WKIEN7">
         <value caption="Enable interrupt and generate interrupt when the WKRDYx status bit is set" name="" value="0x1" />
         <value caption="Disable interrupt" name="" value="0x0" />
      </value-group>
      <value-group caption="Wake-up Clock Count bits" name="ADCANCON__WKUPCLKCNT">
         <value caption="2^15 = 32768 clocks" name="" value="0xf" />
         <value caption="2^14 = 16384 clocks" name="" value="0xe" />
         <value caption="2^13 = 8192 clocks" name="" value="0xd" />
         <value caption="2^12 = 4096 clocks" name="" value="0xc" />
         <value caption="2^11 = 2048 clocks" name="" value="0xb" />
         <value caption="2^10 = 1024 clocks" name="" value="0xa" />
         <value caption="2^9 = 512 clocks" name="" value="0x9" />
         <value caption="2^8 = 256 clocks" name="" value="0x8" />
         <value caption="2^7 = 128 clocks" name="" value="0x7" />
         <value caption="2^6 = 64 clocks" name="" value="0x6" />
         <value caption="2^5 = 32 clocks" name="" value="0x5" />
         <value caption="2^4 = 16 clocks" name="" value="0x0" />
      </value-group>
   </module>
   <module caption="" id="01445" name="CDAC" version="">
      <register-group name="CDAC">
         <register caption="CDAC Control Register" name="DAC1CON" offset="0x0" rw="RW" size="4">
            <bitfield caption="Reference Source Select" mask="0x00000003" name="REFSEL" values="DAC1CON__REFSEL" />
            <bitfield caption="CDAC Output Enable" mask="0x00000100" name="DACOE" values="DAC1CON__DACOE" />
            <bitfield caption="CDAC Enable" mask="0x00008000" name="ON" values="DAC1CON__ON" />
            <bitfield caption="Data Input Register Bits for the CDAC" mask="0xFFFF0000" name="DACDAT" />
         </register>
      </register-group>
