Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK-MC_DFP/1.11.151/atdf/PIC32MK0128MCA032.atdf
         <register caption="Op amp/Comparator x Control Register" name="CM3CON" offset="0x50" rw="RW" size="4">
            <bitfield caption="Comparator Channel Select bits" mask="0x00000003" name="CCH" values="CM3CON__CCH" />
            <bitfield caption="Op amp/Comparator Reference Select bit" mask="0x00000010" name="CREF" values="CM3CON__CREF" />
            <bitfield caption="Trigger/Event Polarity Select bits" mask="0x000000C0" name="EVPOL" values="CM3CON__EVPOL" />
            <bitfield caption="Comparator Output bit" mask="0x00000100" name="COUT" values="CM3CON__COUT" />
            <bitfield caption="Comparator Event bit" mask="0x00000200" name="CEVT" values="CM3CON__CEVT" />
            <bitfield caption="Op-Amp Power mode" mask="0x00001000" name="OPLPWR" values="CM3CON__OPLPWR" />
            <bitfield caption="Comparator Output Polarity Select bit" mask="0x00002000" name="CPOL" values="CM3CON__CPOL" />
            <bitfield caption="Comparator Output Enable bit" mask="0x00004000" name="COE" values="CM3CON__COE" />
            <bitfield caption="Comparator Enable bit" mask="0x00008000" name="ON" values="CM3CON__ON" />
            <bitfield caption="Comparator Output Filter Clock Divide Select bits" mask="0x00070000" name="CFDIV" values="CM3CON__CFDIV" />
            <bitfield caption="Comparator Output Digital Filter Enable bit" mask="0x00080000" name="CFLTREN" values="CM3CON__CFLTREN" />
            <bitfield caption="Comparator Output Filter Clock Source Select bits" mask="0x00700000" name="CFSEL" values="CM3CON__CFSEL" />
            <bitfield caption="Hysteresis Selection bits" mask="0x03000000" name="HYSSEL" values="CM3CON__HYSSEL" />
            <bitfield caption="Comparator Hysteresis Polarity Selection" mask="0x10000000" name="HYSPOL" values="CM3CON__HYSPOL" />
            <bitfield caption="Opamp Fixed Gain Enable bit" mask="0x40000000" name="ENPGA" values="CM3CON__ENPGA" />
            <bitfield caption="Opamp Enable Bit" mask="0x80000000" name="OPAON" values="CM3CON__OPAON" />
         </register>
         <register caption="Comparator x Mask Control Register" name="CM1MSKCON" offset="0x20" rw="RW" size="4">
            <bitfield caption="AND Gate A Inverted Input Enable bit" mask="0x00000001" name="AANEN" values="CM1MSKCON__AANEN" />
            <bitfield caption="AND Gate A Input Enable bit" mask="0x00000002" name="AAEN" values="CM1MSKCON__AAEN" />
            <bitfield caption="AND Gate B Inverted Input Enable bit" mask="0x00000004" name="ABNEN" values="CM1MSKCON__ABNEN" />
            <bitfield caption="AND Gate B Input Enable bit" mask="0x00000008" name="ABEN" values="CM1MSKCON__ABEN" />
            <bitfield caption="AND Gate C Inverted Input Enable bit" mask="0x00000010" name="ACNEN" values="CM1MSKCON__ACNEN" />
            <bitfield caption="AND Gate C Input Enable bit" mask="0x00000020" name="ACEN" values="CM1MSKCON__ACEN" />
            <bitfield caption="Positive AND Gate Output Select bit" mask="0x00000040" name="PAGS" values="CM1MSKCON__PAGS" />
            <bitfield caption="Negative AND Gate Output Select bit" mask="0x00000080" name="NAGS" values="CM1MSKCON__NAGS" />
            <bitfield caption="OR Gate A Input Inverted Enable bit" mask="0x00000100" name="OANEN" values="CM1MSKCON__OANEN" />
            <bitfield caption="OR Gate A Input Enable bit" mask="0x00000200" name="OAEN" values="CM1MSKCON__OAEN" />
            <bitfield caption="OR Gate B Input Inverted Enable bit" mask="0x00000400" name="OBNEN" values="CM1MSKCON__OBNEN" />
            <bitfield caption="OR Gate B Input Enable bit" mask="0x00000800" name="OBEN" values="CM1MSKCON__OBEN" />
            <bitfield caption="OR Gate C Input Inverted Enable bit" mask="0x00001000" name="OCNEN" values="CM1MSKCON__OCNEN" />
            <bitfield caption="OR Gate C Input Enable bit" mask="0x00002000" name="OCEN" values="CM1MSKCON__OCEN" />
            <bitfield caption="High or Low Level Masking Select bit" mask="0x00008000" name="HLMS" values="CM1MSKCON__HLMS" />
            <bitfield caption="Mask A Input Select bits" mask="0x000F0000" name="SELSRCA" values="CM1MSKCON__SELSRCA" />
            <bitfield caption="Mask B Input Select bits" mask="0x00F00000" name="SELSRCB" values="CM1MSKCON__SELSRCB" />
            <bitfield caption="Mask C Input Select bits" mask="0x0F000000" name="SELSRCC" values="CM1MSKCON__SELSRCC" />
         </register>
         <register caption="Comparator x Mask Control Register" name="CM2MSKCON" offset="0x40" rw="RW" size="4">
            <bitfield caption="AND Gate A Inverted Input Enable bit" mask="0x00000001" name="AANEN" values="CM2MSKCON__AANEN" />
            <bitfield caption="AND Gate A Input Enable bit" mask="0x00000002" name="AAEN" values="CM2MSKCON__AAEN" />
            <bitfield caption="AND Gate B Inverted Input Enable bit" mask="0x00000004" name="ABNEN" values="CM2MSKCON__ABNEN" />
            <bitfield caption="AND Gate B Input Enable bit" mask="0x00000008" name="ABEN" values="CM2MSKCON__ABEN" />
            <bitfield caption="AND Gate C Inverted Input Enable bit" mask="0x00000010" name="ACNEN" values="CM2MSKCON__ACNEN" />
            <bitfield caption="AND Gate C Input Enable bit" mask="0x00000020" name="ACEN" values="CM2MSKCON__ACEN" />
            <bitfield caption="Positive AND Gate Output Select bit" mask="0x00000040" name="PAGS" values="CM2MSKCON__PAGS" />
            <bitfield caption="Negative AND Gate Output Select bit" mask="0x00000080" name="NAGS" values="CM2MSKCON__NAGS" />
            <bitfield caption="OR Gate A Input Inverted Enable bit" mask="0x00000100" name="OANEN" values="CM2MSKCON__OANEN" />
            <bitfield caption="OR Gate A Input Enable bit" mask="0x00000200" name="OAEN" values="CM2MSKCON__OAEN" />
            <bitfield caption="OR Gate B Input Inverted Enable bit" mask="0x00000400" name="OBNEN" values="CM2MSKCON__OBNEN" />
            <bitfield caption="OR Gate B Input Enable bit" mask="0x00000800" name="OBEN" values="CM2MSKCON__OBEN" />
            <bitfield caption="OR Gate C Input Inverted Enable bit" mask="0x00001000" name="OCNEN" values="CM2MSKCON__OCNEN" />
            <bitfield caption="OR Gate C Input Enable bit" mask="0x00002000" name="OCEN" values="CM2MSKCON__OCEN" />
            <bitfield caption="High or Low Level Masking Select bit" mask="0x00008000" name="HLMS" values="CM2MSKCON__HLMS" />
            <bitfield caption="Mask A Input Select bits" mask="0x000F0000" name="SELSRCA" values="CM2MSKCON__SELSRCA" />
            <bitfield caption="Mask B Input Select bits" mask="0x00F00000" name="SELSRCB" values="CM2MSKCON__SELSRCB" />
            <bitfield caption="Mask C Input Select bits" mask="0x0F000000" name="SELSRCC" values="CM2MSKCON__SELSRCC" />
         </register>
