Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK-MC_DFP/1.11.151/atdf/PIC32MK0128MCA032.atdf
         <register caption="Comparator x Mask Control Register" name="CM3MSKCON" offset="0x60" rw="RW" size="4">
            <bitfield caption="AND Gate A Inverted Input Enable bit" mask="0x00000001" name="AANEN" values="CM3MSKCON__AANEN" />
            <bitfield caption="AND Gate A Input Enable bit" mask="0x00000002" name="AAEN" values="CM3MSKCON__AAEN" />
            <bitfield caption="AND Gate B Inverted Input Enable bit" mask="0x00000004" name="ABNEN" values="CM3MSKCON__ABNEN" />
            <bitfield caption="AND Gate B Input Enable bit" mask="0x00000008" name="ABEN" values="CM3MSKCON__ABEN" />
            <bitfield caption="AND Gate C Inverted Input Enable bit" mask="0x00000010" name="ACNEN" values="CM3MSKCON__ACNEN" />
            <bitfield caption="AND Gate C Input Enable bit" mask="0x00000020" name="ACEN" values="CM3MSKCON__ACEN" />
            <bitfield caption="Positive AND Gate Output Select bit" mask="0x00000040" name="PAGS" values="CM3MSKCON__PAGS" />
            <bitfield caption="Negative AND Gate Output Select bit" mask="0x00000080" name="NAGS" values="CM3MSKCON__NAGS" />
            <bitfield caption="OR Gate A Input Inverted Enable bit" mask="0x00000100" name="OANEN" values="CM3MSKCON__OANEN" />
            <bitfield caption="OR Gate A Input Enable bit" mask="0x00000200" name="OAEN" values="CM3MSKCON__OAEN" />
            <bitfield caption="OR Gate B Input Inverted Enable bit" mask="0x00000400" name="OBNEN" values="CM3MSKCON__OBNEN" />
            <bitfield caption="OR Gate B Input Enable bit" mask="0x00000800" name="OBEN" values="CM3MSKCON__OBEN" />
            <bitfield caption="OR Gate C Input Inverted Enable bit" mask="0x00001000" name="OCNEN" values="CM3MSKCON__OCNEN" />
            <bitfield caption="OR Gate C Input Enable bit" mask="0x00002000" name="OCEN" values="CM3MSKCON__OCEN" />
            <bitfield caption="High or Low Level Masking Select bit" mask="0x00008000" name="HLMS" values="CM3MSKCON__HLMS" />
            <bitfield caption="Mask A Input Select bits" mask="0x000F0000" name="SELSRCA" values="CM3MSKCON__SELSRCA" />
            <bitfield caption="Mask B Input Select bits" mask="0x00F00000" name="SELSRCB" values="CM3MSKCON__SELSRCB" />
            <bitfield caption="Mask C Input Select bits" mask="0x0F000000" name="SELSRCC" values="CM3MSKCON__SELSRCC" />
         </register>
      </register-group>
      <value-group caption="Op amp/Comparator 1 Output Status bit" name="CMSTAT__C1OUT">
         <value caption="(When CPOL is 0) Vin+ greater than Vth+ / (When CPOL is 1) VIN+  Vth+ / (When CPOL is 1) VIN+ less than VTH-" name="" value="0x1" />
         <value caption="(When CPOL is 0) Vin+  Vth+" name="" value="0x0" />
      </value-group>
      <value-group caption="Op amp/Comparator 2 Output Status bit" name="CMSTAT__C2OUT">
         <value caption="(When CPOL is 0) Vin+ greater than Vth+ / (When CPOL is 1) VIN+  Vth+ / (When CPOL is 1) VIN+ less than VTH-" name="" value="0x1" />
         <value caption="(When CPOL is 0) Vin+  Vth+" name="" value="0x0" />
      </value-group>
      <value-group caption="Op amp/Comparator 3 Output Status bit" name="CMSTAT__C3OUT">
         <value caption="(When CPOL is 0) Vin+ greater than Vth+ / (When CPOL is 1) VIN+  Vth+ / (When CPOL is 1) VIN+ less than VTH-" name="" value="0x1" />
         <value caption="(When CPOL is 0) Vin+  Vth+" name="" value="0x0" />
      </value-group>
      <value-group caption="Op amp/Comparator 4 Output Status bit" name="CMSTAT__C4OUT">
         <value caption="(When CPOL is 0) Vin+ greater than Vth+ / (When CPOL is 1) VIN+  Vth+ / (When CPOL is 1) VIN+ less than VTH-" name="" value="0x1" />
         <value caption="(When CPOL is 0) Vin+  Vth+" name="" value="0x0" />
      </value-group>
      <value-group caption="Op amp/Comparator 5 Output Status bit" name="CMSTAT__C5OUT">
         <value caption="(When CPOL is 0) Vin+ greater than Vth+ / (When CPOL is 1) VIN+  Vth+ / (When CPOL is 1) VIN+ less than VTH-" name="" value="0x1" />
         <value caption="(When CPOL is 0) Vin+  Vth+" name="" value="0x0" />
      </value-group>
      <value-group caption="Stop in Idle Mode bit" name="CMSTAT__SIDL">
         <value caption="Discontinue operation of all Op amp/Comparators when device enters Idle mode" name="" value="0x1" />
         <value caption="Continue module operation in Idle mode" name="" value="0x0" />
      </value-group>
      <value-group caption="Comparator 1 Event Status bit" name="CMSTAT__C1EVT">
         <value caption="Comparator event according to EVPOL settings occurred. Future events/triggers and interrupts are disabled until the CEVT bit (CMxCON) is cleared by user software." name="" value="0x1" />
         <value caption="Comparator event did not occur" name="" value="0x0" />
      </value-group>
      <value-group caption="Comparator 2 Event Status bit" name="CMSTAT__C2EVT">
         <value caption="Comparator event according to EVPOL settings occurred. Future events/triggers and interrupts are disabled until the CEVT bit (CMxCON) is cleared by user software." name="" value="0x1" />
         <value caption="Comparator event did not occur" name="" value="0x0" />
      </value-group>
      <value-group caption="Comparator 3 Event Status bit" name="CMSTAT__C3EVT">
         <value caption="Comparator event according to EVPOL settings occurred. Future events/triggers and interrupts are disabled until the CEVT bit (CMxCON) is cleared by user software." name="" value="0x1" />
         <value caption="Comparator event did not occur" name="" value="0x0" />
      </value-group>
      <value-group caption="Comparator 4 Event Status bit" name="CMSTAT__C4EVT">
         <value caption="Comparator event according to EVPOL settings occurred. Future events/triggers and interrupts are disabled until the CEVT bit (CMxCON) is cleared by user software." name="" value="0x1" />
         <value caption="Comparator event did not occur" name="" value="0x0" />
      </value-group>
      <value-group caption="Comparator 5 Event Status bit" name="CMSTAT__C5EVT">
         <value caption="Comparator event according to EVPOL settings occurred. Future events/triggers and interrupts are disabled until the CEVT bit (CMxCON) is cleared by user software." name="" value="0x1" />
         <value caption="Comparator event did not occur" name="" value="0x0" />
      </value-group>
      <value-group caption="Comparator Channel Select bits" name="CM1CON__CCH">
         <value caption="CxIN4-" name="" value="0x3" />
         <value caption="CxIN3-" name="" value="0x2" />
         <value caption="CxIN2-" name="" value="0x1" />
         <value caption="CxIN1-" name="" value="0x0" />
      </value-group>
      <value-group caption="Op amp/Comparator Reference Select bit" name="CM1CON__CREF">
         <value caption="VIN+ input connects to internal CDAC2 output voltage" name="" value="0x1" />
         <value caption="VIN+ input connects to CxIN1+ pin" name="" value="0x0" />
      </value-group>
      <value-group caption="Trigger/Event Polarity Select bits" name="CM1CON__EVPOL">
         <value caption="Trigger/Event generated on any change of the comparator output" name="" value="0x3" />
         <value caption="(When CPOL is 0) Trigger/Event generated only on high-to-low transition of the polarity-selected comparator output / (When CPOL is 1) Trigger/Event generated only on low-to-high transition of the polarity-selected comparator output" name="" value="0x2" />
         <value caption="(When CPOL is 0) Trigger/Event generated only on low-to-high transition of the polarity-selected comparator output / (When CPOL is 1) Trigger/Event generated only on high-to-low transition of the polarity-selected comparator output" name="" value="0x1" />
         <value caption="Trigger/Event generation is disabled" name="" value="0x0" />
      </value-group>
      <value-group caption="Comparator Output bit" name="CM1CON__COUT">
         <value caption="(When CPOL is 0) VIN+ greater than VTH+ / (When CPOL is 1) VIN+  VTH+ / (When CPOL is 1) VIN+ less than VTH-" name="" value="0x1" />
         <value caption="(When CPOL is 0) VIN+  VTH-" name="" value="0x0" />
      </value-group>
