Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK-MC_DFP/1.11.151/atdf/PIC32MK0128MCA032.atdf
      <value-group caption="Reference Clock Output Enable bit" name="REFO1CON__OE">
         <value caption="Reference clock is driven out on REFCLKOx pin" name="" value="0x1" />
         <value caption="Reference clock is not driven out on REFCLKOx pin" name="" value="0x0" />
      </value-group>
      <value-group caption="Peripheral Stop in Idle Mode bit" name="REFO1CON__SIDL">
         <value caption="Discontinue module operation when the device enters Idle mode" name="" value="0x1" />
         <value caption="Continue module operation in Idle mode" name="" value="0x0" />
      </value-group>
      <value-group caption="Output Enable bit" name="REFO1CON__ON">
         <value caption="Reference Oscillator Module enabled" name="" value="0x1" />
         <value caption="Reference Oscillator Module disabled" name="" value="0x0" />
      </value-group>
      <value-group caption="" name="REFO1CON__RODIV">
         <value caption="RReference Clock output is same as source clock" name="NO_DIV" value="0x0" />
         <value caption="Reference Clock output is source clock divided by 2" name="DIV_2" value="0x1" />
         <value caption="Reference Clock output is source clock divided by 4" name="DIV_4" value="0x2" />
         <value caption="Reference Clock output is source clock divided by 65534" name="DIV_65534" value="0x7fff" />
      </value-group>
      <value-group caption="Reference Clock Source Select bits" name="REFO2CON__ROSEL">
         <value caption="Reserved" name="Reserved" value="0xf" />
         <value caption="Reserved" name="Reserved" value="0xe" />
         <value caption="Reserved" name="Reserved" value="0xd" />
         <value caption="Reserved" name="Reserved" value="0xc" />
         <value caption="Reserved" name="Reserved" value="0xb" />
         <value caption="Reserved" name="Reserved" value="0xa" />
         <value caption="REFCLKI" name="REFCLKI" value="0x8" />
         <value caption="System PLL VCO output" name="Fvco" value="0x7" />
         <value caption="SOSC" name="SOSC" value="0x5" />
         <value caption="LPRC" name="LPRC" value="0x4" />
         <value caption="FRC" name="FRC" value="0x3" />
         <value caption="POSC" name="POSC" value="0x2" />
         <value caption="Peripheral Clock 1 PBCLK1" name="PBCLK1" value="0x1" />
         <value caption="SYSCLK" name="SYSCLK" value="0x0" />
      </value-group>
      <value-group caption="Reference Clock Request Status bit" name="REFO2CON__ACTIVE">
         <value caption="Reference clock request is active" name="" value="0x1" />
         <value caption="Reference clock request is not active" name="" value="0x0" />
      </value-group>
      <value-group caption="Divider Switch Enable bit" name="REFO2CON__DIVSWEN">
         <value caption="Divider switch is in progress" name="" value="0x1" />
         <value caption="Divider switch is complete" name="" value="0x0" />
      </value-group>
      <value-group caption="Reference Oscillator Module Run in Sleep bit" name="REFO2CON__RSLP">
         <value caption="Reference Oscillator Module output continues to run in Sleep" name="" value="0x1" />
         <value caption="Reference Oscillator Module output is disabled in Sleep" name="" value="0x0" />
      </value-group>
      <value-group caption="Reference Clock Output Enable bit" name="REFO2CON__OE">
         <value caption="Reference clock is driven out on REFCLKOx pin" name="" value="0x1" />
         <value caption="Reference clock is not driven out on REFCLKOx pin" name="" value="0x0" />
      </value-group>
      <value-group caption="Peripheral Stop in Idle Mode bit" name="REFO2CON__SIDL">
         <value caption="Discontinue module operation when the device enters Idle mode" name="" value="0x1" />
         <value caption="Continue module operation in Idle mode" name="" value="0x0" />
      </value-group>
      <value-group caption="Output Enable bit" name="REFO2CON__ON">
         <value caption="Reference Oscillator Module enabled" name="" value="0x1" />
         <value caption="Reference Oscillator Module disabled" name="" value="0x0" />
      </value-group>
      <value-group caption="" name="REFO2CON__RODIV">
         <value caption="RReference Clock output is same as source clock" name="NO_DIV" value="0x0" />
         <value caption="Reference Clock output is source clock divided by 2" name="DIV_2" value="0x1" />
         <value caption="Reference Clock output is source clock divided by 4" name="DIV_4" value="0x2" />
         <value caption="Reference Clock output is source clock divided by 65534" name="DIV_65534" value="0x7fff" />
      </value-group>
      <value-group caption="Reference Clock Source Select bits" name="REFO3CON__ROSEL">
         <value caption="REFCLKI" name="REFCLKI" value="0x8" />
         <value caption="System PLL VCO output" name="Fvco" value="0x7" />
         <value caption="SOSC" name="SOSC" value="0x5" />
         <value caption="LPRC" name="LPRC" value="0x4" />
         <value caption="FRC" name="FRC" value="0x3" />
         <value caption="POSC" name="POSC" value="0x2" />
         <value caption="Peripheral Clock 1 PBCLK1" name="PBCLK1" value="0x1" />
         <value caption="SYSCLK" name="SYSCLK" value="0x0" />
      </value-group>
      <value-group caption="Reference Clock Request Status bit" name="REFO3CON__ACTIVE">
         <value caption="Reference clock request is active" name="" value="0x1" />
         <value caption="Reference clock request is not active" name="" value="0x0" />
      </value-group>
      <value-group caption="Divider Switch Enable bit" name="REFO3CON__DIVSWEN">
         <value caption="Divider switch is in progress" name="" value="0x1" />
         <value caption="Divider switch is complete" name="" value="0x0" />
      </value-group>
      <value-group caption="Reference Oscillator Module Run in Sleep bit" name="REFO3CON__RSLP">
         <value caption="Reference Oscillator Module output continues to run in Sleep" name="" value="0x1" />
         <value caption="Reference Oscillator Module output is disabled in Sleep" name="" value="0x0" />
      </value-group>
      <value-group caption="Reference Clock Output Enable bit" name="REFO3CON__OE">
         <value caption="Reference clock is driven out on REFCLKOx pin" name="" value="0x1" />
         <value caption="Reference clock is not driven out on REFCLKOx pin" name="" value="0x0" />
      </value-group>
