Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK-MC_DFP/1.11.151/atdf/PIC32MK0128MCA032.atdf
         <register caption="" name="IPC57" offset="0x4d0" rw="RW" size="4">
            <bitfield caption="" mask="0x00030000" name="SBIS" />
            <bitfield caption="" mask="0x001C0000" name="SBIP" />
         </register>
         <register caption="" name="IPC62" offset="0x520" rw="RW" size="4">
            <bitfield caption="" mask="0x00000300" name="CLC1IS" />
            <bitfield caption="" mask="0x00001C00" name="CLC1IP" />
         </register>
         <register caption="" name="IPC63" offset="0x530" rw="RW" size="4">
            <bitfield caption="" mask="0x00030000" name="CPCIS" />
            <bitfield caption="" mask="0x001C0000" name="CPCIP" />
            <bitfield caption="" mask="0x03000000" name="CFDCIS" />
            <bitfield caption="" mask="0x1C000000" name="CFDCIP" />
         </register>
         <register caption="" name="OFF000" offset="0x540" rw="RW" size="4">
            <bitfield caption="" mask="0x0003FFFE" name="VOFF" />
         </register>
         <register caption="" name="OFF001" offset="0x544" rw="RW" size="4">
            <bitfield caption="" mask="0x0003FFFE" name="VOFF" />
         </register>
         <register caption="" name="OFF002" offset="0x548" rw="RW" size="4">
            <bitfield caption="" mask="0x0003FFFE" name="VOFF" />
         </register>
         <register caption="" name="OFF003" offset="0x54c" rw="RW" size="4">
            <bitfield caption="" mask="0x0003FFFE" name="VOFF" />
         </register>
         <register caption="" name="OFF004" offset="0x550" rw="RW" size="4">
            <bitfield caption="" mask="0x0003FFFE" name="VOFF" />
         </register>
         <register caption="" name="OFF005" offset="0x554" rw="RW" size="4">
            <bitfield caption="" mask="0x0003FFFE" name="VOFF" />
         </register>
         <register caption="" name="OFF006" offset="0x558" rw="RW" size="4">
            <bitfield caption="" mask="0x0003FFFE" name="VOFF" />
         </register>
         <register caption="" name="OFF007" offset="0x55c" rw="RW" size="4">
            <bitfield caption="" mask="0x0003FFFE" name="VOFF" />
         </register>
         <register caption="" name="OFF008" offset="0x560" rw="RW" size="4">
            <bitfield caption="" mask="0x0003FFFE" name="VOFF" />
         </register>
         <register caption="" name="OFF009" offset="0x564" rw="RW" size="4">
            <bitfield caption="" mask="0x0003FFFE" name="VOFF" />
         </register>
         <register caption="" name="OFF010" offset="0x568" rw="RW" size="4">
            <bitfield caption="" mask="0x0003FFFE" name="VOFF" />
         </register>
         <register caption="" name="OFF011" offset="0x56c" rw="RW" size="4">
            <bitfield caption="" mask="0x0003FFFE" name="VOFF" />
         </register>
         <register caption="" name="OFF012" offset="0x570" rw="RW" size="4">
            <bitfield caption="" mask="0x0003FFFE" name="VOFF" />
         </register>
         <register caption="" name="OFF013" offset="0x574" rw="RW" size="4">
            <bitfield caption="" mask="0x0003FFFE" name="VOFF" />
         </register>
         <register caption="" name="OFF014" offset="0x578" rw="RW" size="4">
            <bitfield caption="" mask="0x0003FFFE" name="VOFF" />
         </register>
         <register caption="" name="OFF015" offset="0x57c" rw="RW" size="4">
            <bitfield caption="" mask="0x0003FFFE" name="VOFF" />
         </register>
         <register caption="" name="OFF016" offset="0x580" rw="RW" size="4">
            <bitfield caption="" mask="0x0003FFFE" name="VOFF" />
         </register>
         <register caption="" name="OFF017" offset="0x584" rw="RW" size="4">
            <bitfield caption="" mask="0x0003FFFE" name="VOFF" />
         </register>
         <register caption="" name="OFF018" offset="0x588" rw="RW" size="4">
            <bitfield caption="" mask="0x0003FFFE" name="VOFF" />
         </register>
         <register caption="" name="OFF019" offset="0x58c" rw="RW" size="4">
            <bitfield caption="" mask="0x0003FFFE" name="VOFF" />
         </register>
         <register caption="" name="OFF020" offset="0x590" rw="RW" size="4">
            <bitfield caption="" mask="0x0003FFFE" name="VOFF" />
         </register>
         <register caption="" name="OFF021" offset="0x594" rw="RW" size="4">
            <bitfield caption="" mask="0x0003FFFE" name="VOFF" />
         </register>
         <register caption="" name="OFF022" offset="0x598" rw="RW" size="4">
            <bitfield caption="" mask="0x0003FFFE" name="VOFF" />
         </register>
         <register caption="" name="OFF023" offset="0x59c" rw="RW" size="4">
            <bitfield caption="" mask="0x0003FFFE" name="VOFF" />
         </register>
         <register caption="" name="OFF024" offset="0x5a0" rw="RW" size="4">
            <bitfield caption="" mask="0x0003FFFE" name="VOFF" />
         </register>
         <register caption="" name="OFF030" offset="0x5b8" rw="RW" size="4">
            <bitfield caption="" mask="0x0003FFFE" name="VOFF" />
         </register>
         <register caption="" name="OFF031" offset="0x5bc" rw="RW" size="4">
            <bitfield caption="" mask="0x0003FFFE" name="VOFF" />
         </register>
         <register caption="" name="OFF032" offset="0x5c0" rw="RW" size="4">
            <bitfield caption="" mask="0x0003FFFE" name="VOFF" />
         </register>
         <register caption="" name="OFF033" offset="0x5c4" rw="RW" size="4">
            <bitfield caption="" mask="0x0003FFFE" name="VOFF" />
         </register>
         <register caption="" name="OFF035" offset="0x5cc" rw="RW" size="4">
            <bitfield caption="" mask="0x0003FFFE" name="VOFF" />
         </register>
         <register caption="" name="OFF036" offset="0x5d0" rw="RW" size="4">
            <bitfield caption="" mask="0x0003FFFE" name="VOFF" />
         </register>
         <register caption="" name="OFF037" offset="0x5d4" rw="RW" size="4">
            <bitfield caption="" mask="0x0003FFFE" name="VOFF" />
         </register>
         <register caption="" name="OFF038" offset="0x5d8" rw="RW" size="4">
            <bitfield caption="" mask="0x0003FFFE" name="VOFF" />
         </register>
