Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK-MC_DFP/1.11.151/atdf/PIC32MK0128MCA032.atdf
         <register caption="PWM Control Register x (x = 1 through 12)" name="PWMCON2" offset="0x1c0" rw="RW" size="4">
            <bitfield caption="External PWM Reset Control bit" mask="0x00000002" name="XPRES" values="PWMCON2__XPRES" />
            <bitfield caption="Master Time Base Select bit" mask="0x00000008" name="MTBS" values="PWMCON2__MTBS" />
            <bitfield caption="PWM Timer Direction bit" mask="0x00000010" name="PTDIR" values="PWMCON2__PTDIR" />
            <bitfield caption="Dead Time Compensation Polarity bit" mask="0x00000020" name="DTCP" values="PWMCON2__DTCP" />
            <bitfield caption="Dead Time Control bits" mask="0x000000C0" name="DTC" values="PWMCON2__DTC" />
            <bitfield caption="Independent Time Base Mode bit" mask="0x00000200" name="ITB" values="PWMCON2__ITB" />
            <bitfield caption="Edge/Center-Aligned Mode Enable bits" mask="0x00000C00" name="ECAM" values="PWMCON2__ECAM" />
            <bitfield caption="Current-Limit Interrupt Status bit (This bit is cleared by setting CLIEN to 0)" mask="0x00004000" name="CLTSTAT" values="PWMCON2__CLTSTAT" />
            <bitfield caption="Fault Interrupt Status bit (This bit is cleared by setting FLTIEN to 0)" mask="0x00008000" name="FLTSTAT" values="PWMCON2__FLTSTAT" />
            <bitfield caption="PWM High Phase Interrupt Enable bit" mask="0x00080000" name="PWMHIEN" values="PWMCON2__PWMHIEN" />
            <bitfield caption="PWM Low Phase Interrupt Enable bit" mask="0x00100000" name="PWMLIEN" values="PWMCON2__PWMLIEN" />
            <bitfield caption="Primary Trigger Interrupt Enable bit" mask="0x00200000" name="TRGIEN" values="PWMCON2__TRGIEN" />
            <bitfield caption="Current-Limit Interrupt Enable bit" mask="0x00400000" name="CLIEN" values="PWMCON2__CLIEN" />
            <bitfield caption="Fault Interrupt Enable bit" mask="0x00800000" name="FLTIEN" values="PWMCON2__FLTIEN" />
            <bitfield caption="PWMH Interrupt Status bit" mask="0x08000000" name="PWMHIF" values="PWMCON2__PWMHIF" />
            <bitfield caption="PWML Interrupt Status bit" mask="0x10000000" name="PWMLIF" values="PWMCON2__PWMLIF" />
            <bitfield caption="Trigger Interrupt Status bit" mask="0x20000000" name="TRGIF" values="PWMCON2__TRGIF" />
            <bitfield caption="Current-Limit Status bit" mask="0x40000000" name="CLIF" values="PWMCON2__CLIF" />
            <bitfield caption="Fault Interrupt Flag bit" mask="0x80000000" name="FLTIF" values="PWMCON2__FLTIF" />
         </register>
         <register caption="PWM Control Register x (x = 1 through 12)" name="PWMCON3" offset="0x2c0" rw="RW" size="4">
            <bitfield caption="External PWM Reset Control bit" mask="0x00000002" name="XPRES" values="PWMCON3__XPRES" />
            <bitfield caption="Master Time Base Select bit" mask="0x00000008" name="MTBS" values="PWMCON3__MTBS" />
            <bitfield caption="PWM Timer Direction bit" mask="0x00000010" name="PTDIR" values="PWMCON3__PTDIR" />
            <bitfield caption="Dead Time Compensation Polarity bit" mask="0x00000020" name="DTCP" values="PWMCON3__DTCP" />
            <bitfield caption="Dead Time Control bits" mask="0x000000C0" name="DTC" values="PWMCON3__DTC" />
            <bitfield caption="Independent Time Base Mode bit" mask="0x00000200" name="ITB" values="PWMCON3__ITB" />
            <bitfield caption="Edge/Center-Aligned Mode Enable bits" mask="0x00000C00" name="ECAM" values="PWMCON3__ECAM" />
            <bitfield caption="Current-Limit Interrupt Status bit (This bit is cleared by setting CLIEN to 0)" mask="0x00004000" name="CLTSTAT" values="PWMCON3__CLTSTAT" />
            <bitfield caption="Fault Interrupt Status bit (This bit is cleared by setting FLTIEN to 0)" mask="0x00008000" name="FLTSTAT" values="PWMCON3__FLTSTAT" />
            <bitfield caption="PWM High Phase Interrupt Enable bit" mask="0x00080000" name="PWMHIEN" values="PWMCON3__PWMHIEN" />
            <bitfield caption="PWM Low Phase Interrupt Enable bit" mask="0x00100000" name="PWMLIEN" values="PWMCON3__PWMLIEN" />
            <bitfield caption="Primary Trigger Interrupt Enable bit" mask="0x00200000" name="TRGIEN" values="PWMCON3__TRGIEN" />
            <bitfield caption="Current-Limit Interrupt Enable bit" mask="0x00400000" name="CLIEN" values="PWMCON3__CLIEN" />
            <bitfield caption="Fault Interrupt Enable bit" mask="0x00800000" name="FLTIEN" values="PWMCON3__FLTIEN" />
            <bitfield caption="PWMH Interrupt Status bit" mask="0x08000000" name="PWMHIF" values="PWMCON3__PWMHIF" />
            <bitfield caption="PWML Interrupt Status bit" mask="0x10000000" name="PWMLIF" values="PWMCON3__PWMLIF" />
            <bitfield caption="Trigger Interrupt Status bit" mask="0x20000000" name="TRGIF" values="PWMCON3__TRGIF" />
            <bitfield caption="Current-Limit Status bit" mask="0x40000000" name="CLIF" values="PWMCON3__CLIF" />
            <bitfield caption="Fault Interrupt Flag bit" mask="0x80000000" name="FLTIF" values="PWMCON3__FLTIF" />
         </register>
         <register caption="PWM Control Register x (x = 1 through 12)" name="PWMCON4" offset="0x3c0" rw="RW" size="4">
            <bitfield caption="External PWM Reset Control bit" mask="0x00000002" name="XPRES" values="PWMCON4__XPRES" />
            <bitfield caption="Master Time Base Select bit" mask="0x00000008" name="MTBS" values="PWMCON4__MTBS" />
            <bitfield caption="PWM Timer Direction bit" mask="0x00000010" name="PTDIR" values="PWMCON4__PTDIR" />
            <bitfield caption="Dead Time Compensation Polarity bit" mask="0x00000020" name="DTCP" values="PWMCON4__DTCP" />
            <bitfield caption="Dead Time Control bits" mask="0x000000C0" name="DTC" values="PWMCON4__DTC" />
            <bitfield caption="Independent Time Base Mode bit" mask="0x00000200" name="ITB" values="PWMCON4__ITB" />
            <bitfield caption="Edge/Center-Aligned Mode Enable bits" mask="0x00000C00" name="ECAM" values="PWMCON4__ECAM" />
            <bitfield caption="Current-Limit Interrupt Status bit (This bit is cleared by setting CLIEN to 0)" mask="0x00004000" name="CLTSTAT" values="PWMCON4__CLTSTAT" />
            <bitfield caption="Fault Interrupt Status bit (This bit is cleared by setting FLTIEN to 0)" mask="0x00008000" name="FLTSTAT" values="PWMCON4__FLTSTAT" />
            <bitfield caption="PWM High Phase Interrupt Enable bit" mask="0x00080000" name="PWMHIEN" values="PWMCON4__PWMHIEN" />
            <bitfield caption="PWM Low Phase Interrupt Enable bit" mask="0x00100000" name="PWMLIEN" values="PWMCON4__PWMLIEN" />
            <bitfield caption="Primary Trigger Interrupt Enable bit" mask="0x00200000" name="TRGIEN" values="PWMCON4__TRGIEN" />
            <bitfield caption="Current-Limit Interrupt Enable bit" mask="0x00400000" name="CLIEN" values="PWMCON4__CLIEN" />
            <bitfield caption="Fault Interrupt Enable bit" mask="0x00800000" name="FLTIEN" values="PWMCON4__FLTIEN" />
            <bitfield caption="PWMH Interrupt Status bit" mask="0x08000000" name="PWMHIF" values="PWMCON4__PWMHIF" />
            <bitfield caption="PWML Interrupt Status bit" mask="0x10000000" name="PWMLIF" values="PWMCON4__PWMLIF" />
            <bitfield caption="Trigger Interrupt Status bit" mask="0x20000000" name="TRGIF" values="PWMCON4__TRGIF" />
            <bitfield caption="Current-Limit Status bit" mask="0x40000000" name="CLIF" values="PWMCON4__CLIF" />
            <bitfield caption="Fault Interrupt Flag bit" mask="0x80000000" name="FLTIF" values="PWMCON4__FLTIF" />
         </register>
