Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK-MC_DFP/1.11.151/atdf/PIC32MK0128MCA032.atdf
         <register caption="" name="CAP2" offset="0x270" rw="RW" size="4">
            <bitfield caption="" mask="0x0000FFFF" name="CAP" />
         </register>
         <register caption="" name="CAP3" offset="0x370" rw="RW" size="4">
            <bitfield caption="" mask="0x0000FFFF" name="CAP" />
         </register>
         <register caption="" name="CAP4" offset="0x470" rw="RW" size="4">
            <bitfield caption="" mask="0x0000FFFF" name="CAP" />
         </register>
         <register caption="Leading-Edge Blanking Control Register x (x = 1 through 12)" name="LEBCON1" offset="0x180" rw="RW" size="4">
            <bitfield caption="Current-Limit Leading-Edge Blanking Enable bit" mask="0x00000400" name="CLLEBEN" values="LEBCON1__CLLEBEN" />
            <bitfield caption="Fault Input Leading-Edge Blanking Enable bit" mask="0x00000800" name="FLTLEBEN" values="LEBCON1__FLTLEBEN" />
            <bitfield caption="PWMxL Falling Edge Trigger Enable bit" mask="0x00001000" name="PLF" values="LEBCON1__PLF" />
            <bitfield caption="PWMxL Rising Edge Trigger Enable bit" mask="0x00002000" name="PLR" values="LEBCON1__PLR" />
            <bitfield caption="PWMxH Falling Edge Trigger Enable bit" mask="0x00004000" name="PHF" values="LEBCON1__PHF" />
            <bitfield caption="PWMxH Rising Edge Trigger Enable bit" mask="0x00008000" name="PHR" values="LEBCON1__PHR" />
         </register>
         <register caption="Leading-Edge Blanking Control Register x (x = 1 through 12)" name="LEBCON2" offset="0x280" rw="RW" size="4">
            <bitfield caption="Current-Limit Leading-Edge Blanking Enable bit" mask="0x00000400" name="CLLEBEN" values="LEBCON2__CLLEBEN" />
            <bitfield caption="Fault Input Leading-Edge Blanking Enable bit" mask="0x00000800" name="FLTLEBEN" values="LEBCON2__FLTLEBEN" />
            <bitfield caption="PWMxL Falling Edge Trigger Enable bit" mask="0x00001000" name="PLF" values="LEBCON2__PLF" />
            <bitfield caption="PWMxL Rising Edge Trigger Enable bit" mask="0x00002000" name="PLR" values="LEBCON2__PLR" />
            <bitfield caption="PWMxH Falling Edge Trigger Enable bit" mask="0x00004000" name="PHF" values="LEBCON2__PHF" />
            <bitfield caption="PWMxH Rising Edge Trigger Enable bit" mask="0x00008000" name="PHR" values="LEBCON2__PHR" />
         </register>
         <register caption="Leading-Edge Blanking Control Register x (x = 1 through 12)" name="LEBCON3" offset="0x380" rw="RW" size="4">
            <bitfield caption="Current-Limit Leading-Edge Blanking Enable bit" mask="0x00000400" name="CLLEBEN" values="LEBCON3__CLLEBEN" />
            <bitfield caption="Fault Input Leading-Edge Blanking Enable bit" mask="0x00000800" name="FLTLEBEN" values="LEBCON3__FLTLEBEN" />
            <bitfield caption="PWMxL Falling Edge Trigger Enable bit" mask="0x00001000" name="PLF" values="LEBCON3__PLF" />
            <bitfield caption="PWMxL Rising Edge Trigger Enable bit" mask="0x00002000" name="PLR" values="LEBCON3__PLR" />
            <bitfield caption="PWMxH Falling Edge Trigger Enable bit" mask="0x00004000" name="PHF" values="LEBCON3__PHF" />
            <bitfield caption="PWMxH Rising Edge Trigger Enable bit" mask="0x00008000" name="PHR" values="LEBCON3__PHR" />
         </register>
         <register caption="Leading-Edge Blanking Control Register x (x = 1 through 12)" name="LEBCON4" offset="0x480" rw="RW" size="4">
            <bitfield caption="Current-Limit Leading-Edge Blanking Enable bit" mask="0x00000400" name="CLLEBEN" values="LEBCON4__CLLEBEN" />
            <bitfield caption="Fault Input Leading-Edge Blanking Enable bit" mask="0x00000800" name="FLTLEBEN" values="LEBCON4__FLTLEBEN" />
            <bitfield caption="PWMxL Falling Edge Trigger Enable bit" mask="0x00001000" name="PLF" values="LEBCON4__PLF" />
            <bitfield caption="PWMxL Rising Edge Trigger Enable bit" mask="0x00002000" name="PLR" values="LEBCON4__PLR" />
            <bitfield caption="PWMxH Falling Edge Trigger Enable bit" mask="0x00004000" name="PHF" values="LEBCON4__PHF" />
            <bitfield caption="PWMxH Rising Edge Trigger Enable bit" mask="0x00008000" name="PHR" values="LEBCON4__PHR" />
         </register>
         <register caption="" name="LEBDLY1" offset="0x190" rw="RW" size="4">
            <bitfield caption="" mask="0x00000FFF" name="LEB" />
         </register>
         <register caption="" name="LEBDLY2" offset="0x290" rw="RW" size="4">
            <bitfield caption="" mask="0x00000FFF" name="LEB" />
         </register>
         <register caption="" name="LEBDLY3" offset="0x390" rw="RW" size="4">
            <bitfield caption="" mask="0x00000FFF" name="LEB" />
         </register>
         <register caption="" name="LEBDLY4" offset="0x490" rw="RW" size="4">
            <bitfield caption="" mask="0x00000FFF" name="LEB" />
         </register>
         <register caption="PWM Auxiliary Control Register x (x = 1 through 12)" name="AUXCON1" offset="0x1a0" rw="RW" size="4">
            <bitfield caption="PWMxL Output Chopping Enable bit" mask="0x00000001" name="CHOPLEN" values="AUXCON1__CHOPLEN" />
            <bitfield caption="PWMxH Output Chopping Enable bit" mask="0x00000002" name="CHOPHEN" values="AUXCON1__CHOPHEN" />
            <bitfield caption="PWM Chop Clock Source Select bits" mask="0x0000003C" name="CHOPSEL" values="AUXCON1__CHOPSEL" />
         </register>
         <register caption="PWM Auxiliary Control Register x (x = 1 through 12)" name="AUXCON2" offset="0x2a0" rw="RW" size="4">
            <bitfield caption="PWMxL Output Chopping Enable bit" mask="0x00000001" name="CHOPLEN" values="AUXCON2__CHOPLEN" />
            <bitfield caption="PWMxH Output Chopping Enable bit" mask="0x00000002" name="CHOPHEN" values="AUXCON2__CHOPHEN" />
            <bitfield caption="PWM Chop Clock Source Select bits" mask="0x0000003C" name="CHOPSEL" values="AUXCON2__CHOPSEL" />
         </register>
         <register caption="PWM Auxiliary Control Register x (x = 1 through 12)" name="AUXCON3" offset="0x3a0" rw="RW" size="4">
            <bitfield caption="PWMxL Output Chopping Enable bit" mask="0x00000001" name="CHOPLEN" values="AUXCON3__CHOPLEN" />
            <bitfield caption="PWMxH Output Chopping Enable bit" mask="0x00000002" name="CHOPHEN" values="AUXCON3__CHOPHEN" />
            <bitfield caption="PWM Chop Clock Source Select bits" mask="0x0000003C" name="CHOPSEL" values="AUXCON3__CHOPSEL" />
         </register>
         <register caption="PWM Auxiliary Control Register x (x = 1 through 12)" name="AUXCON4" offset="0x4a0" rw="RW" size="4">
            <bitfield caption="PWMxL Output Chopping Enable bit" mask="0x00000001" name="CHOPLEN" values="AUXCON4__CHOPLEN" />
            <bitfield caption="PWMxH Output Chopping Enable bit" mask="0x00000002" name="CHOPHEN" values="AUXCON4__CHOPHEN" />
            <bitfield caption="PWM Chop Clock Source Select bits" mask="0x0000003C" name="CHOPSEL" values="AUXCON4__CHOPSEL" />
         </register>
         <register caption="" name="PTMR1" offset="0x1b0" rw="RW" size="4">
            <bitfield caption="" mask="0x0000FFFF" name="TMR" />
         </register>
         <register caption="" name="PTMR2" offset="0x2b0" rw="RW" size="4">
            <bitfield caption="" mask="0x0000FFFF" name="TMR" />
         </register>
         <register caption="" name="PTMR3" offset="0x3b0" rw="RW" size="4">
            <bitfield caption="" mask="0x0000FFFF" name="TMR" />
         </register>
