Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK-MC_DFP/1.11.151/atdf/PIC32MK0128MCA032.atdf
      <value-group caption="Output Compare Timer Select bit" name="OC2CON__OCTSEL">
         <value caption="Timer3 is the clock source for this Output Compare module" name="" value="0x1" />
         <value caption="Timer2 is the clock source for this Output Compare module" name="" value="0x0" />
      </value-group>
      <value-group caption="PWM Fault Condition Status bit" name="OC2CON__OCFLT">
         <value caption="PWM Fault condition has occurred (cleared in HW only)" name="" value="0x1" />
         <value caption="No PWM Fault condition has occurred" name="" value="0x0" />
      </value-group>
      <value-group caption="32-bit Compare Mode bit" name="OC2CON__OC32">
         <value caption="OCxR(31-0) and/or OCxRS(31-0) are used for comparisions to the 32-bit timer source" name="" value="0x1" />
         <value caption="OCxR(15-0) and OCxRS(15-0) are used for comparisons to the 16-bit timer source" name="" value="0x0" />
      </value-group>
      <value-group caption="Stop in Idle Mode bit" name="OC2CON__SIDL">
         <value caption="Discontinue operation when CPU enters Idle mode" name="" value="0x1" />
         <value caption="Continue operation in Idle mode" name="" value="0x0" />
      </value-group>
      <value-group caption="Output Compare Peripheral On bit" name="OC2CON__ON">
         <value caption="Output Compare peripheral is enabled" name="" value="0x1" />
         <value caption="Output Compare peripheral is disabled" name="" value="0x0" />
      </value-group>
      <value-group caption="Output Compare Mode Select bits" name="OC3CON__OCM">
         <value caption="PWM mode on OCx; Fault pin enabled" name="" value="0x7" />
         <value caption="PWM mode on OCx; Fault pin disabled" name="" value="0x6" />
         <value caption="Initialize OCx pin low; generate continious output pulses on OCx pin" name="" value="0x5" />
         <value caption="Initialize OCx pin low: generate single output pulse on OCx pin" name="" value="0x4" />
         <value caption="Compare event toggles OCx pin" name="" value="0x3" />
         <value caption="Initialize OCx pin high; compare event forces OCx pin low" name="" value="0x2" />
         <value caption="Initialize OCx pin low; compare event forces OCx pin high" name="" value="0x1" />
         <value caption="Output compare peripheral is disabled but continues to draw current" name="" value="0x0" />
      </value-group>
      <value-group caption="Output Compare Timer Select bit" name="OC3CON__OCTSEL">
         <value caption="Timer3 is the clock source for this Output Compare module" name="" value="0x1" />
         <value caption="Timer2 is the clock source for this Output Compare module" name="" value="0x0" />
      </value-group>
      <value-group caption="PWM Fault Condition Status bit" name="OC3CON__OCFLT">
         <value caption="PWM Fault condition has occurred (cleared in HW only)" name="" value="0x1" />
         <value caption="No PWM Fault condition has occurred" name="" value="0x0" />
      </value-group>
      <value-group caption="32-bit Compare Mode bit" name="OC3CON__OC32">
         <value caption="OCxR(31-0) and/or OCxRS(31-0) are used for comparisions to the 32-bit timer source" name="" value="0x1" />
         <value caption="OCxR(15-0) and OCxRS(15-0) are used for comparisons to the 16-bit timer source" name="" value="0x0" />
      </value-group>
      <value-group caption="Stop in Idle Mode bit" name="OC3CON__SIDL">
         <value caption="Discontinue operation when CPU enters Idle mode" name="" value="0x1" />
         <value caption="Continue operation in Idle mode" name="" value="0x0" />
      </value-group>
      <value-group caption="Output Compare Peripheral On bit" name="OC3CON__ON">
         <value caption="Output Compare peripheral is enabled" name="" value="0x1" />
         <value caption="Output Compare peripheral is disabled" name="" value="0x0" />
      </value-group>
      <value-group caption="Output Compare Mode Select bits" name="OC4CON__OCM">
         <value caption="PWM mode on OCx; Fault pin enabled" name="" value="0x7" />
         <value caption="PWM mode on OCx; Fault pin disabled" name="" value="0x6" />
         <value caption="Initialize OCx pin low; generate continious output pulses on OCx pin" name="" value="0x5" />
         <value caption="Initialize OCx pin low: generate single output pulse on OCx pin" name="" value="0x4" />
         <value caption="Compare event toggles OCx pin" name="" value="0x3" />
         <value caption="Initialize OCx pin high; compare event forces OCx pin low" name="" value="0x2" />
         <value caption="Initialize OCx pin low; compare event forces OCx pin high" name="" value="0x1" />
         <value caption="Output compare peripheral is disabled but continues to draw current" name="" value="0x0" />
      </value-group>
      <value-group caption="Output Compare Timer Select bit" name="OC4CON__OCTSEL">
         <value caption="Timer3 is the clock source for this Output Compare module" name="" value="0x1" />
         <value caption="Timer2 is the clock source for this Output Compare module" name="" value="0x0" />
      </value-group>
      <value-group caption="PWM Fault Condition Status bit" name="OC4CON__OCFLT">
         <value caption="PWM Fault condition has occurred (cleared in HW only)" name="" value="0x1" />
         <value caption="No PWM Fault condition has occurred" name="" value="0x0" />
      </value-group>
      <value-group caption="32-bit Compare Mode bit" name="OC4CON__OC32">
         <value caption="OCxR(31-0) and/or OCxRS(31-0) are used for comparisions to the 32-bit timer source" name="" value="0x1" />
         <value caption="OCxR(15-0) and OCxRS(15-0) are used for comparisons to the 16-bit timer source" name="" value="0x0" />
      </value-group>
      <value-group caption="Stop in Idle Mode bit" name="OC4CON__SIDL">
         <value caption="Discontinue operation when CPU enters Idle mode" name="" value="0x1" />
         <value caption="Continue operation in Idle mode" name="" value="0x0" />
      </value-group>
      <value-group caption="Output Compare Peripheral On bit" name="OC4CON__ON">
         <value caption="Output Compare peripheral is enabled" name="" value="0x1" />
         <value caption="Output Compare peripheral is disabled" name="" value="0x0" />
      </value-group>
   </module>
   <module caption="" id="03088" name="PCACHE" version="">
      <register-group name="PCACHE">
         <register caption="" name="CHECON" offset="0x0" rw="RW" size="4">
            <bitfield caption="" mask="0x0000000F" name="PFMWS" />
            <bitfield caption="" mask="0x00000030" name="PREFEN" />
            <bitfield caption="" mask="0x00000080" name="PFMSECEN" />
            <bitfield caption="" mask="0x00000100" name="PFMAWSEN" />
            <bitfield caption="" mask="0x00001000" name="CHEPERFEN" />
            <bitfield caption="" mask="0x00010000" name="ICHECOH" />
            <bitfield caption="" mask="0x00020000" name="DCHECOH" />
            <bitfield caption="" mask="0x00040000" name="PERCHECOH" />
            <bitfield caption="" mask="0x00100000" name="ICHEINV" />
            <bitfield caption="" mask="0x00200000" name="DCHEINV" />
            <bitfield caption="" mask="0x00400000" name="PERCHEINV" />
            <bitfield caption="" mask="0x01000000" name="ICHEEN" />
            <bitfield caption="" mask="0x02000000" name="DCHEEN" />
            <bitfield caption="" mask="0x04000000" name="PERCHEEN" />
         </register>
         <register caption="" name="CHESTAT" offset="0x10" rw="RW" size="4">
            <bitfield caption="" mask="0x000000FF" name="PFMSECCNT" />
            <bitfield caption="" mask="0x04000000" name="PFMSEC" />
            <bitfield caption="" mask="0x08000000" name="PFMDED" />
         </register>
         <register caption="" name="CHEHIT" offset="0x20" rw="R" size="4">
            <bitfield caption="" mask="0xFFFFFFFF" name="CHEHIT" />
         </register>
         <register caption="" name="CHEMIS" offset="0x30" rw="R" size="4">
            <bitfield caption="" mask="0xFFFFFFFF" name="CHEMIS" />
         </register>
      </register-group>
   </module>
   <module caption="" id="01494" name="QEI" version="1">
      <register-group name="QEI">
         <register caption="QEIx Control Register" name="QEI1CON" offset="0x0" rw="RW" size="4">
            <bitfield caption="Counter Control Mode Selection bits" mask="0x00000003" name="CCM" values="QEI1CON__CCM" />
            <bitfield caption="External Count Gate Enable bit" mask="0x00000004" name="GATEN" values="QEI1CON__GATEN" />
            <bitfield caption="Position and Index Counter/Timer Direction Select bit" mask="0x00000008" name="CNTPOL" values="QEI1CON__CNTPOL" />
            <bitfield caption="Timer Input Clock Prescale Select bits " mask="0x00000070" name="INTDIV" values="QEI1CON__INTDIV" />
            <bitfield caption="Index Match Value bits" mask="0x00000300" name="IMV" values="QEI1CON__IMV" />
            <bitfield caption="Position Counter Initialization Mode Select bits" mask="0x00001C00" name="PIMOD" values="QEI1CON__PIMOD" />
            <bitfield caption="Stop in Idle Mode bit" mask="0x00002000" name="QEISIDL" values="QEI1CON__QEISIDL" />
            <bitfield caption="Quadrature Encoder Interface Module Counter Enable bit" mask="0x00008000" name="QEIEN" values="QEI1CON__QEIEN" />
         </register>
         <register caption="QEIx Control Register" name="QEI2CON" offset="0x200" rw="RW" size="4">
            <bitfield caption="Counter Control Mode Selection bits" mask="0x00000003" name="CCM" values="QEI2CON__CCM" />
            <bitfield caption="External Count Gate Enable bit" mask="0x00000004" name="GATEN" values="QEI2CON__GATEN" />
            <bitfield caption="Position and Index Counter/Timer Direction Select bit" mask="0x00000008" name="CNTPOL" values="QEI2CON__CNTPOL" />
            <bitfield caption="Timer Input Clock Prescale Select bits " mask="0x00000070" name="INTDIV" values="QEI2CON__INTDIV" />
            <bitfield caption="Index Match Value bits" mask="0x00000300" name="IMV" values="QEI2CON__IMV" />
            <bitfield caption="Position Counter Initialization Mode Select bits" mask="0x00001C00" name="PIMOD" values="QEI2CON__PIMOD" />
            <bitfield caption="Stop in Idle Mode bit" mask="0x00002000" name="QEISIDL" values="QEI2CON__QEISIDL" />
            <bitfield caption="Quadrature Encoder Interface Module Counter Enable bit" mask="0x00008000" name="QEIEN" values="QEI2CON__QEIEN" />
         </register>
