Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK-MC_DFP/1.11.151/atdf/PIC32MK0128MCA032.atdf
         <register caption="QEIx I/O Control Register" name="QEI1IOC" offset="0x10" rw="RW" size="4">
            <bitfield caption="Status of QEAx Input Pin after Polarity Control and SWPAB Pin Swapping bit" mask="0x00000001" name="QEA" values="QEI1IOC__QEA" />
            <bitfield caption="Status of QEBx Input Pin after Polarity Control and SWPAB Pin Swapping bit" mask="0x00000002" name="QEB" values="QEI1IOC__QEB" />
            <bitfield caption="Status of INDXx Input Pin after Polarity Control bit" mask="0x00000004" name="INDEX" values="QEI1IOC__INDEX" />
            <bitfield caption="Status of HOMEx Input Pin after Polarity Control bit" mask="0x00000008" name="HOME" values="QEI1IOC__HOME" />
            <bitfield caption="QEAx Input Polarity Select bit" mask="0x00000010" name="QEAPOL" values="QEI1IOC__QEAPOL" />
            <bitfield caption="QEBx Input Polarity Select bit" mask="0x00000020" name="QEBPOL" values="QEI1IOC__QEBPOL" />
            <bitfield caption="INDXx Input Polarity Select bit" mask="0x00000040" name="IDXPOL" values="QEI1IOC__IDXPOL" />
            <bitfield caption="HOMEx Input Polarity Select bit" mask="0x00000080" name="HOMPOL" values="QEI1IOC__HOMPOL" />
            <bitfield caption="Swap QEA and QEB Inputs bit" mask="0x00000100" name="SWPAB" values="QEI1IOC__SWPAB" />
            <bitfield caption="QEI Module Output Function Mode Select bits" mask="0x00000600" name="OUTFNC" values="QEI1IOC__OUTFNC" />
            <bitfield caption="QEA/QEB/INDX/HOMEx Digital Input Filter Clock Divide Select bits" mask="0x00003800" name="QFDIV" values="QEI1IOC__QFDIV" />
            <bitfield caption="QEA/QEB/INDX/HOMEx Digital Filter Enable bit" mask="0x00004000" name="FLTREN" values="QEI1IOC__FLTREN" />
            <bitfield caption="Position Counter Input Capture Enable bit" mask="0x00008000" name="QCAPEN" values="QEI1IOC__QCAPEN" />
            <bitfield caption="Position Counter Input Capture by Home Event Enable bit" mask="0x00010000" name="HCAPEN" values="QEI1IOC__HCAPEN" />
         </register>
         <register caption="QEIx I/O Control Register" name="QEI2IOC" offset="0x210" rw="RW" size="4">
            <bitfield caption="Status of QEAx Input Pin after Polarity Control and SWPAB Pin Swapping bit" mask="0x00000001" name="QEA" values="QEI2IOC__QEA" />
            <bitfield caption="Status of QEBx Input Pin after Polarity Control and SWPAB Pin Swapping bit" mask="0x00000002" name="QEB" values="QEI2IOC__QEB" />
            <bitfield caption="Status of INDXx Input Pin after Polarity Control bit" mask="0x00000004" name="INDEX" values="QEI2IOC__INDEX" />
            <bitfield caption="Status of HOMEx Input Pin after Polarity Control bit" mask="0x00000008" name="HOME" values="QEI2IOC__HOME" />
            <bitfield caption="QEAx Input Polarity Select bit" mask="0x00000010" name="QEAPOL" values="QEI2IOC__QEAPOL" />
            <bitfield caption="QEBx Input Polarity Select bit" mask="0x00000020" name="QEBPOL" values="QEI2IOC__QEBPOL" />
            <bitfield caption="INDXx Input Polarity Select bit" mask="0x00000040" name="IDXPOL" values="QEI2IOC__IDXPOL" />
            <bitfield caption="HOMEx Input Polarity Select bit" mask="0x00000080" name="HOMPOL" values="QEI2IOC__HOMPOL" />
            <bitfield caption="Swap QEA and QEB Inputs bit" mask="0x00000100" name="SWPAB" values="QEI2IOC__SWPAB" />
            <bitfield caption="QEI Module Output Function Mode Select bits" mask="0x00000600" name="OUTFNC" values="QEI2IOC__OUTFNC" />
            <bitfield caption="QEA/QEB/INDX/HOMEx Digital Input Filter Clock Divide Select bits" mask="0x00003800" name="QFDIV" values="QEI2IOC__QFDIV" />
            <bitfield caption="QEA/QEB/INDX/HOMEx Digital Filter Enable bit" mask="0x00004000" name="FLTREN" values="QEI2IOC__FLTREN" />
            <bitfield caption="Position Counter Input Capture Enable bit" mask="0x00008000" name="QCAPEN" values="QEI2IOC__QCAPEN" />
            <bitfield caption="Position Counter Input Capture by Home Event Enable bit" mask="0x00010000" name="HCAPEN" values="QEI2IOC__HCAPEN" />
         </register>
         <register caption="QEIx Status Register" name="QEI1STAT" offset="0x20" rw="RW" size="4">
            <bitfield caption="Index Input Event Interrupt Enable bit" mask="0x00000001" name="IDXIEN" values="QEI1STAT__IDXIEN" />
            <bitfield caption="Status Flag for Index Event Status bit" mask="0x00000002" name="IDXIRQ" values="QEI1STAT__IDXIRQ" />
            <bitfield caption="Home Input Event Interrupt Enable bit" mask="0x00000004" name="HOMIEN" values="QEI1STAT__HOMIEN" />
            <bitfield caption="Status Flag for Home Event Status bit" mask="0x00000008" name="HOMIRQ" values="QEI1STAT__HOMIRQ" />
            <bitfield caption="Velocity Counter Overflow Interrupt Enable bit" mask="0x00000010" name="VELOVIEN" values="QEI1STAT__VELOVIEN" />
            <bitfield caption="Velocity Counter Overflow Status bit" mask="0x00000020" name="VELOVIRQ" values="QEI1STAT__VELOVIRQ" />
            <bitfield caption="Position Counter Initialization Process Complete Interrupt Enable bit" mask="0x00000040" name="PCIIEN" values="QEI1STAT__PCIIEN" />
            <bitfield caption="Position Counter Initialization Process Complete Status bit" mask="0x00000080" name="PCIIRQ" values="QEI1STAT__PCIIRQ" />
            <bitfield caption="Position Counter Overflow Interrupt Enable bit" mask="0x00000100" name="POSOVIEN" values="QEI1STAT__POSOVIEN" />
            <bitfield caption="Position Counter Overflow Status bit" mask="0x00000200" name="POSOVIRQ" values="QEI1STAT__POSOVIRQ" />
            <bitfield caption="Position Counter Less Than or Equal Compare Interrupt Enable bit" mask="0x00000400" name="PCLEQIEN" values="QEI1STAT__PCLEQIEN" />
            <bitfield caption="Position Counter Less Than or Equal Compare Status bit" mask="0x00000800" name="PCLEQIRQ" values="QEI1STAT__PCLEQIRQ" />
            <bitfield caption="Position Counter Greater Than or Equal Compare Interrupt Enable bit" mask="0x00001000" name="PCHEQIEN" values="QEI1STAT__PCHEQIEN" />
            <bitfield caption="Position Counter Greater Than or Equal Compare Status bit" mask="0x00002000" name="PCHEQIRQ" values="QEI1STAT__PCHEQIRQ" />
         </register>
         <register caption="QEIx Status Register" name="QEI2STAT" offset="0x220" rw="RW" size="4">
            <bitfield caption="Index Input Event Interrupt Enable bit" mask="0x00000001" name="IDXIEN" values="QEI2STAT__IDXIEN" />
            <bitfield caption="Status Flag for Index Event Status bit" mask="0x00000002" name="IDXIRQ" values="QEI2STAT__IDXIRQ" />
            <bitfield caption="Home Input Event Interrupt Enable bit" mask="0x00000004" name="HOMIEN" values="QEI2STAT__HOMIEN" />
            <bitfield caption="Status Flag for Home Event Status bit" mask="0x00000008" name="HOMIRQ" values="QEI2STAT__HOMIRQ" />
            <bitfield caption="Velocity Counter Overflow Interrupt Enable bit" mask="0x00000010" name="VELOVIEN" values="QEI2STAT__VELOVIEN" />
            <bitfield caption="Velocity Counter Overflow Status bit" mask="0x00000020" name="VELOVIRQ" values="QEI2STAT__VELOVIRQ" />
            <bitfield caption="Position Counter Initialization Process Complete Interrupt Enable bit" mask="0x00000040" name="PCIIEN" values="QEI2STAT__PCIIEN" />
            <bitfield caption="Position Counter Initialization Process Complete Status bit" mask="0x00000080" name="PCIIRQ" values="QEI2STAT__PCIIRQ" />
            <bitfield caption="Position Counter Overflow Interrupt Enable bit" mask="0x00000100" name="POSOVIEN" values="QEI2STAT__POSOVIEN" />
            <bitfield caption="Position Counter Overflow Status bit" mask="0x00000200" name="POSOVIRQ" values="QEI2STAT__POSOVIRQ" />
            <bitfield caption="Position Counter Less Than or Equal Compare Interrupt Enable bit" mask="0x00000400" name="PCLEQIEN" values="QEI2STAT__PCLEQIEN" />
            <bitfield caption="Position Counter Less Than or Equal Compare Status bit" mask="0x00000800" name="PCLEQIRQ" values="QEI2STAT__PCLEQIRQ" />
            <bitfield caption="Position Counter Greater Than or Equal Compare Interrupt Enable bit" mask="0x00001000" name="PCHEQIEN" values="QEI2STAT__PCHEQIEN" />
            <bitfield caption="Position Counter Greater Than or Equal Compare Status bit" mask="0x00002000" name="PCHEQIRQ" values="QEI2STAT__PCHEQIRQ" />
         </register>
