Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK-MC_DFP/1.11.151/atdf/PIC32MK0128MCA032.atdf
      <value-group caption="QEAx Input Polarity Select bit" name="QEI2IOC__QEAPOL">
         <value caption="Input is inverted" name="" value="0x1" />
         <value caption="Input is not inverted" name="" value="0x0" />
      </value-group>
      <value-group caption="QEBx Input Polarity Select bit" name="QEI2IOC__QEBPOL">
         <value caption="Input is inverted" name="" value="0x1" />
         <value caption="Input is not inverted" name="" value="0x0" />
      </value-group>
      <value-group caption="INDXx Input Polarity Select bit" name="QEI2IOC__IDXPOL">
         <value caption="Input is inverted" name="" value="0x1" />
         <value caption="Input is not inverted" name="" value="0x0" />
      </value-group>
      <value-group caption="HOMEx Input Polarity Select bit" name="QEI2IOC__HOMPOL">
         <value caption="Input is inverted" name="" value="0x1" />
         <value caption="Input is not inverted" name="" value="0x0" />
      </value-group>
      <value-group caption="Swap QEA and QEB Inputs bit" name="QEI2IOC__SWPAB">
         <value caption="QEAx and QEBx are swapped prior to quadrature decoder logic" name="" value="0x1" />
         <value caption="QEAx and QEBx are not swapped" name="" value="0x0" />
      </value-group>
      <value-group caption="QEI Module Output Function Mode Select bits" name="QEI2IOC__OUTFNC">
         <value caption="The CNTCMPx pin goes high when POSxCNT QEIxCMPL or POSxCNT  QEIxICCH" name="" value="0x3" />
         <value caption="The CNTCMPx pin goes high when POSxCNT  QEIxCMPL" name="" value="0x2" />
         <value caption="The CNTCMPx pin goes high when POSxCNT QEIxICCH" name="" value="0x1" />
         <value caption="Output is disabled" name="" value="0x0" />
      </value-group>
      <value-group caption="QEA/QEB/INDX/HOMEx Digital Input Filter Clock Divide Select bits" name="QEI2IOC__QFDIV">
         <value caption="1:128 clock divide" name="" value="0x7" />
         <value caption="1:64 clock divide" name="" value="0x6" />
         <value caption="1:32 clock divide" name="" value="0x5" />
         <value caption="1:16 clock divide" name="" value="0x4" />
         <value caption="1:8 clock divide" name="" value="0x3" />
         <value caption="1:4 clock divide" name="" value="0x2" />
         <value caption="1:2 clock divide" name="" value="0x1" />
         <value caption="1:1 clock divide" name="" value="0x0" />
      </value-group>
      <value-group caption="QEA/QEB/INDX/HOMEx Digital Filter Enable bit" name="QEI2IOC__FLTREN">
         <value caption="Input Pin Digital filter is enabled" name="" value="0x1" />
         <value caption="Input Pin Digital filter is disabled (bypassed)" name="" value="0x0" />
      </value-group>
      <value-group caption="Position Counter Input Capture Enable bit" name="QEI2IOC__QCAPEN">
         <value caption="Positive edge detect of Home input triggers position capture function" name="" value="0x1" />
         <value caption="Home input event (positive edge) does not trigger a capture even" name="" value="0x0" />
      </value-group>
      <value-group caption="Position Counter Input Capture by Home Event Enable bit" name="QEI2IOC__HCAPEN">
         <value caption="HOMEx input event (positive edge) triggers a position capture event" name="" value="0x1" />
         <value caption="HOMEx input event (positive edge) does not trigger a position capture event" name="" value="0x0" />
      </value-group>
      <value-group caption="Index Input Event Interrupt Enable bit" name="QEI1STAT__IDXIEN">
         <value caption="Interrupt is enabled" name="" value="0x1" />
         <value caption="Interrupt is disabled" name="" value="0x0" />
      </value-group>
      <value-group caption="Status Flag for Index Event Status bit" name="QEI1STAT__IDXIRQ">
         <value caption="Index event has occurred" name="" value="0x1" />
         <value caption="No Index event has occurred" name="" value="0x0" />
      </value-group>
      <value-group caption="Home Input Event Interrupt Enable bit" name="QEI1STAT__HOMIEN">
         <value caption="Interrupt is enabled" name="" value="0x1" />
         <value caption="Interrupt is disabled" name="" value="0x0" />
      </value-group>
      <value-group caption="Status Flag for Home Event Status bit" name="QEI1STAT__HOMIRQ">
         <value caption="Home event has occurred" name="" value="0x1" />
         <value caption="No Home event has occurred" name="" value="0x0" />
      </value-group>
      <value-group caption="Velocity Counter Overflow Interrupt Enable bit" name="QEI1STAT__VELOVIEN">
         <value caption="Interrupt is enabled" name="" value="0x1" />
         <value caption="Interrupt is disabled" name="" value="0x0" />
      </value-group>
      <value-group caption="Velocity Counter Overflow Status bit" name="QEI1STAT__VELOVIRQ">
         <value caption="Overflow has occurred" name="" value="0x1" />
         <value caption="No overflow has not occurred" name="" value="0x0" />
      </value-group>
      <value-group caption="Position Counter Initialization Process Complete Interrupt Enable bit" name="QEI1STAT__PCIIEN">
         <value caption="Interrupt is enabled" name="" value="0x1" />
         <value caption="Interrupt is disabled" name="" value="0x0" />
      </value-group>
      <value-group caption="Position Counter Initialization Process Complete Status bit" name="QEI1STAT__PCIIRQ">
         <value caption="POSxCNT was reinitialized" name="" value="0x1" />
         <value caption="POSxCNT was not reinitialized" name="" value="0x0" />
      </value-group>
      <value-group caption="Position Counter Overflow Interrupt Enable bit" name="QEI1STAT__POSOVIEN">
         <value caption="Interrupt is enabled" name="" value="0x1" />
         <value caption="Interrupt is disabled" name="" value="0x0" />
      </value-group>
      <value-group caption="Position Counter Overflow Status bit" name="QEI1STAT__POSOVIRQ">
         <value caption="Overflow has occurred" name="" value="0x1" />
         <value caption="No overflow has occurred" name="" value="0x0" />
      </value-group>
      <value-group caption="Position Counter Less Than or Equal Compare Interrupt Enable bit" name="QEI1STAT__PCLEQIEN">
         <value caption="Interrupt is enabled" name="" value="0x1" />
         <value caption="Interrupt is disabled" name="" value="0x0" />
      </value-group>
      <value-group caption="Position Counter Less Than or Equal Compare Status bit" name="QEI1STAT__PCLEQIRQ">
         <value caption="POSxCNT less than or equal to QEIxCMPL" name="" value="0x1" />
         <value caption="POSxCNT greater than QEIxCMPL" name="" value="0x0" />
      </value-group>
