Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK-MC_DFP/1.11.151/atdf/PIC32MK0128MCA032.atdf
         <register caption="System Bus Target 'x' Error Control Register" name="SBT0ECON" offset="0x7b18" rw="RW" size="4">
            <bitfield caption="Error Control bit" mask="0x01000000" name="ERRP" values="SBT0ECON__ERRP" />
         </register>
         <register caption="System Bus Target 'x' Error Control Register" name="SBT1ECON" offset="0x7f18" rw="RW" size="4">
            <bitfield caption="Error Control bit" mask="0x01000000" name="ERRP" values="SBT1ECON__ERRP" />
         </register>
         <register caption="System Bus Target 'x' Error Control Register" name="SBT2ECON" offset="0x8318" rw="RW" size="4">
            <bitfield caption="Error Control bit" mask="0x01000000" name="ERRP" values="SBT2ECON__ERRP" />
         </register>
         <register caption="System Bus Target 'x' Error Control Register" name="SBT3ECON" offset="0x8718" rw="RW" size="4">
            <bitfield caption="Error Control bit" mask="0x01000000" name="ERRP" values="SBT3ECON__ERRP" />
         </register>
         <register caption="" name="SBT0ECLRS" offset="0x7b20" rw="R" size="4">
            <bitfield caption="" mask="0x00000001" name="CLEAR" />
         </register>
         <register caption="" name="SBT1ECLRS" offset="0x7f20" rw="R" size="4">
            <bitfield caption="" mask="0x00000001" name="CLEAR" />
         </register>
         <register caption="" name="SBT2ECLRS" offset="0x8320" rw="R" size="4">
            <bitfield caption="" mask="0x00000001" name="CLEAR" />
         </register>
         <register caption="" name="SBT3ECLRS" offset="0x8720" rw="R" size="4">
            <bitfield caption="" mask="0x00000001" name="CLEAR" />
         </register>
         <register caption="" name="SBT0ECLRM" offset="0x7b28" rw="R" size="4">
            <bitfield caption="" mask="0x00000001" name="CLEAR" />
         </register>
         <register caption="" name="SBT1ECLRM" offset="0x7f28" rw="R" size="4">
            <bitfield caption="" mask="0x00000001" name="CLEAR" />
         </register>
         <register caption="" name="SBT2ECLRM" offset="0x8328" rw="R" size="4">
            <bitfield caption="" mask="0x00000001" name="CLEAR" />
         </register>
         <register caption="" name="SBT3ECLRM" offset="0x8728" rw="R" size="4">
            <bitfield caption="" mask="0x00000001" name="CLEAR" />
         </register>
         <register caption="" name="SBT0REG0" offset="0x7b30" rw="RW" size="4">
            <bitfield caption="Region Size bits" mask="0x000000F8" name="SIZE" values="SBT0REG0__SIZE" />
            <bitfield caption="Region Priority Level bit" mask="0x00000200" name="PRI" values="SBT0REG0__PRI" />
            <bitfield mask="0xFFFFFC00" name="BASE" />
         </register>
         <register caption="" name="SBT0REG1" offset="0x7b50" rw="RW" size="4">
            <bitfield caption="Region Size bits" mask="0x000000F8" name="SIZE" values="SBT0REG1__SIZE" />
            <bitfield caption="Region Priority Level bit" mask="0x00000200" name="PRI" values="SBT0REG1__PRI" />
            <bitfield mask="0xFFFFFC00" name="BASE" />
         </register>
         <register caption="" name="SBT1REG0" offset="0x7f30" rw="RW" size="4">
            <bitfield caption="Region Size bits" mask="0x000000F8" name="SIZE" values="SBT1REG0__SIZE" />
            <bitfield caption="Region Priority Level bit" mask="0x00000200" name="PRI" values="SBT1REG0__PRI" />
            <bitfield mask="0xFFFFFC00" name="BASE" />
         </register>
         <register caption="" name="SBT1REG2" offset="0x7f70" rw="RW" size="4">
            <bitfield caption="Region Size bits" mask="0x000000F8" name="SIZE" values="SBT1REG2__SIZE" />
            <bitfield caption="Region Priority Level bit" mask="0x00000200" name="PRI" values="SBT1REG2__PRI" />
            <bitfield mask="0xFFFFFC00" name="BASE" />
         </register>
         <register caption="" name="SBT1REG3" offset="0x7f90" rw="RW" size="4">
            <bitfield caption="Region Size bits" mask="0x000000F8" name="SIZE" values="SBT1REG3__SIZE" />
            <bitfield caption="Region Priority Level bit" mask="0x00000200" name="PRI" values="SBT1REG3__PRI" />
            <bitfield mask="0xFFFFFC00" name="BASE" />
         </register>
         <register caption="" name="SBT1REG4" offset="0x7fb0" rw="RW" size="4">
            <bitfield caption="Region Size bits" mask="0x000000F8" name="SIZE" values="SBT1REG4__SIZE" />
            <bitfield caption="Region Priority Level bit" mask="0x00000200" name="PRI" values="SBT1REG4__PRI" />
            <bitfield mask="0xFFFFFC00" name="BASE" />
         </register>
         <register caption="" name="SBT1REG5" offset="0x7fd0" rw="RW" size="4">
            <bitfield caption="Region Size bits" mask="0x000000F8" name="SIZE" values="SBT1REG5__SIZE" />
            <bitfield caption="Region Priority Level bit" mask="0x00000200" name="PRI" values="SBT1REG5__PRI" />
            <bitfield mask="0xFFFFFC00" name="BASE" />
         </register>
         <register caption="" name="SBT1REG6" offset="0x7ff0" rw="RW" size="4">
            <bitfield caption="Region Size bits" mask="0x000000F8" name="SIZE" values="SBT1REG6__SIZE" />
            <bitfield caption="Region Priority Level bit" mask="0x00000200" name="PRI" values="SBT1REG6__PRI" />
            <bitfield mask="0xFFFFFC00" name="BASE" />
         </register>
         <register caption="" name="SBT1REG7" offset="0x8010" rw="RW" size="4">
            <bitfield caption="Region Size bits" mask="0x000000F8" name="SIZE" values="SBT1REG7__SIZE" />
            <bitfield caption="Region Priority Level bit" mask="0x00000200" name="PRI" values="SBT1REG7__PRI" />
            <bitfield mask="0xFFFFFC00" name="BASE" />
         </register>
         <register caption="" name="SBT1REG8" offset="0x8030" rw="RW" size="4">
            <bitfield caption="Region Size bits" mask="0x000000F8" name="SIZE" values="SBT1REG8__SIZE" />
            <bitfield caption="Region Priority Level bit" mask="0x00000200" name="PRI" values="SBT1REG8__PRI" />
            <bitfield mask="0xFFFFFC00" name="BASE" />
         </register>
         <register caption="" name="SBT2REG0" offset="0x8330" rw="RW" size="4">
            <bitfield caption="Region Size bits" mask="0x000000F8" name="SIZE" values="SBT2REG0__SIZE" />
            <bitfield caption="Region Priority Level bit" mask="0x00000200" name="PRI" values="SBT2REG0__PRI" />
            <bitfield mask="0xFFFFFC00" name="BASE" />
         </register>
         <register caption="" name="SBT2REG1" offset="0x8350" rw="RW" size="4">
            <bitfield caption="Region Size bits" mask="0x000000F8" name="SIZE" values="SBT2REG1__SIZE" />
            <bitfield caption="Region Priority Level bit" mask="0x00000200" name="PRI" values="SBT2REG1__PRI" />
            <bitfield mask="0xFFFFFC00" name="BASE" />
         </register>
         <register caption="" name="SBT2REG2" offset="0x8370" rw="RW" size="4">
            <bitfield caption="Region Size bits" mask="0x000000F8" name="SIZE" values="SBT2REG2__SIZE" />
            <bitfield caption="Region Priority Level bit" mask="0x00000200" name="PRI" values="SBT2REG2__PRI" />
            <bitfield mask="0xFFFFFC00" name="BASE" />
         </register>
         <register caption="" name="SBT3REG0" offset="0x8730" rw="RW" size="4">
            <bitfield caption="Region Size bits" mask="0x000000F8" name="SIZE" values="SBT3REG0__SIZE" />
            <bitfield caption="Region Priority Level bit" mask="0x00000200" name="PRI" values="SBT3REG0__PRI" />
            <bitfield mask="0xFFFFFC00" name="BASE" />
         </register>
         <register caption="" name="SBT3REG1" offset="0x8750" rw="RW" size="4">
            <bitfield caption="Region Size bits" mask="0x000000F8" name="SIZE" values="SBT3REG1__SIZE" />
            <bitfield caption="Region Priority Level bit" mask="0x00000200" name="PRI" values="SBT3REG1__PRI" />
            <bitfield mask="0xFFFFFC00" name="BASE" />
         </register>
         <register caption="" name="SBT3REG2" offset="0x8770" rw="RW" size="4">
            <bitfield caption="Region Size bits" mask="0x000000F8" name="SIZE" values="SBT3REG2__SIZE" />
            <bitfield caption="Region Priority Level bit" mask="0x00000200" name="PRI" values="SBT3REG2__PRI" />
            <bitfield mask="0xFFFFFC00" name="BASE" />
         </register>
         <register caption="" name="SBT0RD0" offset="0x7b40" rw="RW" size="4">
            <bitfield caption="Group0 Read Permissions bits" mask="0x00000001" name="GROUP0" values="SBT0RD0__GROUP0" />
            <bitfield caption="Group1 Read Permissions bits" mask="0x00000002" name="GROUP1" values="SBT0RD0__GROUP1" />
            <bitfield caption="Group2 Read Permissions bits" mask="0x00000004" name="GROUP2" values="SBT0RD0__GROUP2" />
            <bitfield caption="Group3 Read Permissions bits" mask="0x00000008" name="GROUP3" values="SBT0RD0__GROUP3" />
         </register>
         <register caption="" name="SBT0RD1" offset="0x7b60" rw="RW" size="4">
            <bitfield caption="Group0 Read Permissions bits" mask="0x00000001" name="GROUP0" values="SBT0RD1__GROUP0" />
            <bitfield caption="Group1 Read Permissions bits" mask="0x00000002" name="GROUP1" values="SBT0RD1__GROUP1" />
            <bitfield caption="Group2 Read Permissions bits" mask="0x00000004" name="GROUP2" values="SBT0RD1__GROUP2" />
            <bitfield caption="Group3 Read Permissions bits" mask="0x00000008" name="GROUP3" values="SBT0RD1__GROUP3" />
         </register>
         <register caption="" name="SBT1RD0" offset="0x7f40" rw="RW" size="4">
            <bitfield caption="Group0 Read Permissions bits" mask="0x00000001" name="GROUP0" values="SBT1RD0__GROUP0" />
            <bitfield caption="Group1 Read Permissions bits" mask="0x00000002" name="GROUP1" values="SBT1RD0__GROUP1" />
            <bitfield caption="Group2 Read Permissions bits" mask="0x00000004" name="GROUP2" values="SBT1RD0__GROUP2" />
            <bitfield caption="Group3 Read Permissions bits" mask="0x00000008" name="GROUP3" values="SBT1RD0__GROUP3" />
         </register>
         <register caption="" name="SBT1RD2" offset="0x7f80" rw="RW" size="4">
            <bitfield caption="Group0 Read Permissions bits" mask="0x00000001" name="GROUP0" values="SBT1RD2__GROUP0" />
            <bitfield caption="Group1 Read Permissions bits" mask="0x00000002" name="GROUP1" values="SBT1RD2__GROUP1" />
            <bitfield caption="Group2 Read Permissions bits" mask="0x00000004" name="GROUP2" values="SBT1RD2__GROUP2" />
            <bitfield caption="Group3 Read Permissions bits" mask="0x00000008" name="GROUP3" values="SBT1RD2__GROUP3" />
         </register>
         <register caption="" name="SBT1RD3" offset="0x7fa0" rw="RW" size="4">
            <bitfield caption="Group0 Read Permissions bits" mask="0x00000001" name="GROUP0" values="SBT1RD3__GROUP0" />
            <bitfield caption="Group1 Read Permissions bits" mask="0x00000002" name="GROUP1" values="SBT1RD3__GROUP1" />
            <bitfield caption="Group2 Read Permissions bits" mask="0x00000004" name="GROUP2" values="SBT1RD3__GROUP2" />
            <bitfield caption="Group3 Read Permissions bits" mask="0x00000008" name="GROUP3" values="SBT1RD3__GROUP3" />
         </register>
         <register caption="" name="SBT1RD4" offset="0x7fc0" rw="RW" size="4">
            <bitfield caption="Group0 Read Permissions bits" mask="0x00000001" name="GROUP0" values="SBT1RD4__GROUP0" />
            <bitfield caption="Group1 Read Permissions bits" mask="0x00000002" name="GROUP1" values="SBT1RD4__GROUP1" />
            <bitfield caption="Group2 Read Permissions bits" mask="0x00000004" name="GROUP2" values="SBT1RD4__GROUP2" />
            <bitfield caption="Group3 Read Permissions bits" mask="0x00000008" name="GROUP3" values="SBT1RD4__GROUP3" />
         </register>
         <register caption="" name="SBT1RD5" offset="0x7fe0" rw="RW" size="4">
            <bitfield caption="Group0 Read Permissions bits" mask="0x00000001" name="GROUP0" values="SBT1RD5__GROUP0" />
            <bitfield caption="Group1 Read Permissions bits" mask="0x00000002" name="GROUP1" values="SBT1RD5__GROUP1" />
            <bitfield caption="Group2 Read Permissions bits" mask="0x00000004" name="GROUP2" values="SBT1RD5__GROUP2" />
            <bitfield caption="Group3 Read Permissions bits" mask="0x00000008" name="GROUP3" values="SBT1RD5__GROUP3" />
         </register>
         <register caption="" name="SBT1RD6" offset="0x8000" rw="RW" size="4">
            <bitfield caption="Group0 Read Permissions bits" mask="0x00000001" name="GROUP0" values="SBT1RD6__GROUP0" />
            <bitfield caption="Group1 Read Permissions bits" mask="0x00000002" name="GROUP1" values="SBT1RD6__GROUP1" />
            <bitfield caption="Group2 Read Permissions bits" mask="0x00000004" name="GROUP2" values="SBT1RD6__GROUP2" />
            <bitfield caption="Group3 Read Permissions bits" mask="0x00000008" name="GROUP3" values="SBT1RD6__GROUP3" />
         </register>
         <register caption="" name="SBT1RD7" offset="0x8020" rw="RW" size="4">
            <bitfield caption="Group0 Read Permissions bits" mask="0x00000001" name="GROUP0" values="SBT1RD7__GROUP0" />
            <bitfield caption="Group1 Read Permissions bits" mask="0x00000002" name="GROUP1" values="SBT1RD7__GROUP1" />
            <bitfield caption="Group2 Read Permissions bits" mask="0x00000004" name="GROUP2" values="SBT1RD7__GROUP2" />
            <bitfield caption="Group3 Read Permissions bits" mask="0x00000008" name="GROUP3" values="SBT1RD7__GROUP3" />
         </register>
         <register caption="" name="SBT1RD8" offset="0x8040" rw="RW" size="4">
            <bitfield caption="Group0 Read Permissions bits" mask="0x00000001" name="GROUP0" values="SBT1RD8__GROUP0" />
            <bitfield caption="Group1 Read Permissions bits" mask="0x00000002" name="GROUP1" values="SBT1RD8__GROUP1" />
            <bitfield caption="Group2 Read Permissions bits" mask="0x00000004" name="GROUP2" values="SBT1RD8__GROUP2" />
            <bitfield caption="Group3 Read Permissions bits" mask="0x00000008" name="GROUP3" values="SBT1RD8__GROUP3" />
         </register>
         <register caption="" name="SBT2RD0" offset="0x8340" rw="RW" size="4">
            <bitfield caption="Group0 Read Permissions bits" mask="0x00000001" name="GROUP0" values="SBT2RD0__GROUP0" />
            <bitfield caption="Group1 Read Permissions bits" mask="0x00000002" name="GROUP1" values="SBT2RD0__GROUP1" />
            <bitfield caption="Group2 Read Permissions bits" mask="0x00000004" name="GROUP2" values="SBT2RD0__GROUP2" />
            <bitfield caption="Group3 Read Permissions bits" mask="0x00000008" name="GROUP3" values="SBT2RD0__GROUP3" />
         </register>
         <register caption="" name="SBT2RD1" offset="0x8360" rw="RW" size="4">
            <bitfield caption="Group0 Read Permissions bits" mask="0x00000001" name="GROUP0" values="SBT2RD1__GROUP0" />
            <bitfield caption="Group1 Read Permissions bits" mask="0x00000002" name="GROUP1" values="SBT2RD1__GROUP1" />
            <bitfield caption="Group2 Read Permissions bits" mask="0x00000004" name="GROUP2" values="SBT2RD1__GROUP2" />
            <bitfield caption="Group3 Read Permissions bits" mask="0x00000008" name="GROUP3" values="SBT2RD1__GROUP3" />
         </register>
